# Comparing `tmp/fastcons-0.2.1-cp311-cp311-musllinux_1_1_x86_64.whl.zip` & `tmp/fastcons-0.3.0-cp311-cp311-musllinux_1_1_x86_64.whl.zip`

## zipinfo {}

```diff
@@ -1,10 +1,10 @@
-Zip file size: 30016 bytes, number of entries: 8
-drwxr-xr-x  2.0 unx        0 b- stor 23-Apr-09 14:03 fastcons-0.2.1.dist-info/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Apr-09 14:03 fastcons.libs/
--rwxr-xr-x  2.0 unx    72024 b- defN 23-Apr-09 14:03 fastcons.cpython-311-x86_64-linux-musl.so
--rw-r--r--  2.0 unx      113 b- defN 23-Apr-09 14:03 fastcons-0.2.1.dist-info/WHEEL
--rw-r--r--  2.0 unx       20 b- defN 23-Apr-09 14:03 fastcons-0.2.1.dist-info/top_level.txt
--rw-r--r--  2.0 unx     1069 b- defN 23-Apr-09 14:03 fastcons-0.2.1.dist-info/LICENSE.txt
--rw-rw-r--  2.0 unx      501 b- defN 23-Apr-09 14:03 fastcons-0.2.1.dist-info/RECORD
--rw-r--r--  2.0 unx     2619 b- defN 23-Apr-09 14:03 fastcons-0.2.1.dist-info/METADATA
-8 files, 76346 bytes uncompressed, 28890 bytes compressed:  62.2%
+Zip file size: 30593 bytes, number of entries: 8
+drwxr-xr-x  2.0 unx        0 b- stor 23-Apr-20 20:32 fastcons-0.3.0.dist-info/
+drwxr-xr-x  2.0 unx        0 b- stor 23-Apr-20 20:32 fastcons.libs/
+-rwxr-xr-x  2.0 unx    73168 b- defN 23-Apr-20 20:32 fastcons.cpython-311-x86_64-linux-musl.so
+-rw-r--r--  2.0 unx      113 b- defN 23-Apr-20 20:32 fastcons-0.3.0.dist-info/WHEEL
+-rw-r--r--  2.0 unx       20 b- defN 23-Apr-20 20:32 fastcons-0.3.0.dist-info/top_level.txt

-    <1b8>   DW_AT_name        : (strp) (offset: 0x57e): Py_hash_t
+    <1b8>   DW_AT_name        : (strp) (offset: 0x58e): Py_hash_t
     <1bc>   DW_AT_decl_file   : (data1) 9
     <1bd>   DW_AT_decl_line   : (data1) 145
     <1be>   DW_AT_decl_column : (data1) 20
     <1bf>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
- <1><1c3>: Abbrev Number: 4 (DW_TAG_base_type)
-    <1c4>   DW_AT_byte_size   : (data1) 4
-    <1c5>   DW_AT_encoding    : (data1) 4	(float)
-    <1c6>   DW_AT_name        : (strp) (offset: 0x872): float
- <1><1ca>: Abbrev Number: 11 (DW_TAG_variable)
-    <1cb>   DW_AT_name        : (strp) (offset: 0x198e): signgam
-    <1cf>   DW_AT_decl_file   : (data1) 10
-    <1d0>   DW_AT_decl_line   : (data2) 384
-    <1d2>   DW_AT_decl_column : (data1) 12
-    <1d3>   DW_AT_type        : (ref4) <0x4f>, int
-    <1d7>   DW_AT_external    : (flag_present) 1
-    <1d7>   DW_AT_declaration : (flag_present) 1
- <1><1d7>: Abbrev Number: 12 (DW_TAG_array_type)
-    <1d8>   DW_AT_type        : (ref4) <0xea>, char
-    <1dc>   DW_AT_sibling     : (ref4) <0x1e7>
- <2><1e0>: Abbrev Number: 13 (DW_TAG_subrange_type)
-    <1e1>   DW_AT_type        : (ref4) <0x62>, long unsigned int
-    <1e5>   DW_AT_upper_bound : (data1) 1
- <2><1e6>: Abbrev Number: 0
- <1><1e7>: Abbrev Number: 9 (DW_TAG_variable)
-    <1e8>   DW_AT_name        : (strp) (offset: 0x1581): tzname
-    <1ec>   DW_AT_decl_file   : (data1) 11
-    <1ed>   DW_AT_decl_line   : (data1) 114
-    <1ee>   DW_AT_decl_column : (data1) 14
-    <1ef>   DW_AT_type        : (ref4) <0x1d7>, char
-    <1f3>   DW_AT_external    : (flag_present) 1
-    <1f3>   DW_AT_declaration : (flag_present) 1
+ <1><1c3>: Abbrev Number: 3 (DW_TAG_typedef)
+    <1c4>   DW_AT_name        : (strp) (offset: 0x1bc): Py_uhash_t
+    <1c8>   DW_AT_decl_file   : (data1) 9
+    <1c9>   DW_AT_decl_line   : (data1) 148
+    <1ca>   DW_AT_decl_column : (data1) 16
+    <1cb>   DW_AT_type        : (ref4) <0x56>, size_t, long unsigned int
+ <1><1cf>: Abbrev Number: 4 (DW_TAG_base_type)
+    <1d0>   DW_AT_byte_size   : (data1) 4
+    <1d1>   DW_AT_encoding    : (data1) 4	(float)
+    <1d2>   DW_AT_name        : (strp) (offset: 0x882): float
+ <1><1d6>: Abbrev Number: 11 (DW_TAG_variable)
+    <1d7>   DW_AT_name        : (strp) (offset: 0x199e): signgam
+    <1db>   DW_AT_decl_file   : (data1) 10
+    <1dc>   DW_AT_decl_line   : (data2) 384
+    <1de>   DW_AT_decl_column : (data1) 12
+    <1df>   DW_AT_type        : (ref4) <0x4f>, int
+    <1e3>   DW_AT_external    : (flag_present) 1
+    <1e3>   DW_AT_declaration : (flag_present) 1
+ <1><1e3>: Abbrev Number: 12 (DW_TAG_array_type)
+    <1e4>   DW_AT_type        : (ref4) <0xea>, char
+    <1e8>   DW_AT_sibling     : (ref4) <0x1f3>
+ <2><1ec>: Abbrev Number: 13 (DW_TAG_subrange_type)
+    <1ed>   DW_AT_type        : (ref4) <0x62>, long unsigned int
+    <1f1>   DW_AT_upper_bound : (data1) 1
+ <2><1f2>: Abbrev Number: 0
  <1><1f3>: Abbrev Number: 9 (DW_TAG_variable)
-    <1f4>   DW_AT_name        : (strp) (offset: 0x2382): daylight
+    <1f4>   DW_AT_name        : (strp) (offset: 0x1591): tzname
     <1f8>   DW_AT_decl_file   : (data1) 11
-    <1f9>   DW_AT_decl_line   : (data1) 121
-    <1fa>   DW_AT_decl_column : (data1) 12
-    <1fb>   DW_AT_type        : (ref4) <0x4f>, int
+    <1f9>   DW_AT_decl_line   : (data1) 114
+    <1fa>   DW_AT_decl_column : (data1) 14
+    <1fb>   DW_AT_type        : (ref4) <0x1e3>, char
     <1ff>   DW_AT_external    : (flag_present) 1
     <1ff>   DW_AT_declaration : (flag_present) 1
  <1><1ff>: Abbrev Number: 9 (DW_TAG_variable)
-    <200>   DW_AT_name        : (strp) (offset: 0xa4e): timezone
+    <200>   DW_AT_name        : (strp) (offset: 0x23af): daylight
     <204>   DW_AT_decl_file   : (data1) 11
-    <205>   DW_AT_decl_line   : (data1) 122
-    <206>   DW_AT_decl_column : (data1) 13
-    <207>   DW_AT_type        : (ref4) <0x6e>, long int
+    <205>   DW_AT_decl_line   : (data1) 121
+    <206>   DW_AT_decl_column : (data1) 12
+    <207>   DW_AT_type        : (ref4) <0x4f>, int
     <20b>   DW_AT_external    : (flag_present) 1
     <20b>   DW_AT_declaration : (flag_present) 1
  <1><20b>: Abbrev Number: 9 (DW_TAG_variable)
-    <20c>   DW_AT_name        : (strp) (offset: 0x214a): getdate_err
+    <20c>   DW_AT_name        : (strp) (offset: 0xa5e): timezone
     <210>   DW_AT_decl_file   : (data1) 11
-    <211>   DW_AT_decl_line   : (data1) 123
-    <212>   DW_AT_decl_column : (data1) 12
-    <213>   DW_AT_type        : (ref4) <0x4f>, int
+    <211>   DW_AT_decl_line   : (data1) 122
+    <212>   DW_AT_decl_column : (data1) 13
+    <213>   DW_AT_type        : (ref4) <0x6e>, long int
     <217>   DW_AT_external    : (flag_present) 1
     <217>   DW_AT_declaration : (flag_present) 1
- <1><217>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <218>   DW_AT_name        : (strp) (offset: 0x127b): PyModuleDef
-    <21c>   DW_AT_byte_size   : (data1) 104
-    <21d>   DW_AT_decl_file   : (data1) 12
-    <21e>   DW_AT_decl_line   : (data1) 74
-    <21f>   DW_AT_decl_column : (data1) 8
-    <220>   DW_AT_sibling     : (ref4) <0x29a>
- <2><224>: Abbrev Number: 15 (DW_TAG_member)
-    <225>   DW_AT_name        : (strp) (offset: 0x22a8): m_base
+ <1><217>: Abbrev Number: 9 (DW_TAG_variable)
+    <218>   DW_AT_name        : (strp) (offset: 0x2172): getdate_err
+    <21c>   DW_AT_decl_file   : (data1) 11
+    <21d>   DW_AT_decl_line   : (data1) 123
+    <21e>   DW_AT_decl_column : (data1) 12
+    <21f>   DW_AT_type        : (ref4) <0x4f>, int
+    <223>   DW_AT_external    : (flag_present) 1
+    <223>   DW_AT_declaration : (flag_present) 1
+ <1><223>: Abbrev Number: 14 (DW_TAG_structure_type)
+    <224>   DW_AT_name        : (strp) (offset: 0x128b): PyModuleDef
+    <228>   DW_AT_byte_size   : (data1) 104
     <229>   DW_AT_decl_file   : (data1) 12
-    <22a>   DW_AT_decl_line   : (data1) 75
-    <22b>   DW_AT_decl_column : (data1) 20
-    <22c>   DW_AT_type        : (ref4) <0x1a38>, PyModuleDef_Base, PyModuleDef_Base
-    <230>   DW_AT_data_member_location: (data1) 0
- <2><231>: Abbrev Number: 15 (DW_TAG_member)
-    <232>   DW_AT_name        : (strp) (offset: 0x1d77): m_name
-    <236>   DW_AT_decl_file   : (data1) 12
-    <237>   DW_AT_decl_line   : (data1) 76
-    <238>   DW_AT_decl_column : (data1) 15
-    <239>   DW_AT_type        : (ref4) <0xf0>, char
-    <23d>   DW_AT_data_member_location: (data1) 40
- <2><23e>: Abbrev Number: 15 (DW_TAG_member)
-    <23f>   DW_AT_name        : (strp) (offset: 0x138f): m_doc
-    <243>   DW_AT_decl_file   : (data1) 12
-    <244>   DW_AT_decl_line   : (data1) 77
-    <245>   DW_AT_decl_column : (data1) 15
-    <246>   DW_AT_type        : (ref4) <0xf0>, char
-    <24a>   DW_AT_data_member_location: (data1) 48
- <2><24b>: Abbrev Number: 15 (DW_TAG_member)
-    <24c>   DW_AT_name        : (strp) (offset: 0xcfa): m_size
-    <250>   DW_AT_decl_file   : (data1) 12
-    <251>   DW_AT_decl_line   : (data1) 78
-    <252>   DW_AT_decl_column : (data1) 14
-    <253>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
-    <257>   DW_AT_data_member_location: (data1) 56
- <2><258>: Abbrev Number: 15 (DW_TAG_member)
-    <259>   DW_AT_name        : (strp) (offset: 0x23f3): m_methods
-    <25d>   DW_AT_decl_file   : (data1) 12
-    <25e>   DW_AT_decl_line   : (data1) 79
-    <25f>   DW_AT_decl_column : (data1) 16
-    <260>   DW_AT_type        : (ref4) <0x13ef>, PyMethodDef, PyMethodDef
-    <264>   DW_AT_data_member_location: (data1) 64
- <2><265>: Abbrev Number: 15 (DW_TAG_member)
-    <266>   DW_AT_name        : (strp) (offset: 0x17cf): m_slots
-    <26a>   DW_AT_decl_file   : (data1) 12
-    <26b>   DW_AT_decl_line   : (data1) 80
-    <26c>   DW_AT_decl_column : (data1) 21
-    <26d>   DW_AT_type        : (ref4) <0x1a44>, PyModuleDef_Slot, PyModuleDef_Slot
-    <271>   DW_AT_data_member_location: (data1) 72
- <2><272>: Abbrev Number: 15 (DW_TAG_member)
-    <273>   DW_AT_name        : (strp) (offset: 0x1874): m_traverse
-    <277>   DW_AT_decl_file   : (data1) 12
-    <278>   DW_AT_decl_line   : (data1) 81
-    <279>   DW_AT_decl_column : (data1) 16
-    <27a>   DW_AT_type        : (ref4) <0xd29>, traverseproc, int
-    <27e>   DW_AT_data_member_location: (data1) 80
- <2><27f>: Abbrev Number: 15 (DW_TAG_member)
-    <280>   DW_AT_name        : (strp) (offset: 0x119b): m_clear
-    <284>   DW_AT_decl_file   : (data1) 12
-    <285>   DW_AT_decl_line   : (data1) 82
-    <286>   DW_AT_decl_column : (data1) 11
-    <287>   DW_AT_type        : (ref4) <0xc1f>, inquiry, int
-    <28b>   DW_AT_data_member_location: (data1) 88
- <2><28c>: Abbrev Number: 15 (DW_TAG_member)
-    <28d>   DW_AT_name        : (strp) (offset: 0x2206): m_free
-    <291>   DW_AT_decl_file   : (data1) 12
-    <292>   DW_AT_decl_line   : (data1) 83
-    <293>   DW_AT_decl_column : (data1) 12
-    <294>   DW_AT_type        : (ref4) <0xd54>, freefunc
-    <298>   DW_AT_data_member_location: (data1) 96
- <2><299>: Abbrev Number: 0
- <1><29a>: Abbrev Number: 3 (DW_TAG_typedef)
-    <29b>   DW_AT_name        : (strp) (offset: 0x13d0): PyModuleDef_Slot
-    <29f>   DW_AT_decl_file   : (data1) 13
-    <2a0>   DW_AT_decl_line   : (data1) 13
-    <2a1>   DW_AT_decl_column : (data1) 33
-    <2a2>   DW_AT_type        : (ref4) <0x2a6>, PyModuleDef_Slot
- <1><2a6>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <2a7>   DW_AT_name        : (strp) (offset: 0x13d0): PyModuleDef_Slot
-    <2ab>   DW_AT_byte_size   : (data1) 16
-    <2ac>   DW_AT_decl_file   : (data1) 12
-    <2ad>   DW_AT_decl_line   : (data1) 60
-    <2ae>   DW_AT_decl_column : (data1) 8
-    <2af>   DW_AT_sibling     : (ref4) <0x2ce>
- <2><2b3>: Abbrev Number: 15 (DW_TAG_member)
-    <2b4>   DW_AT_name        : (strp) (offset: 0x22a3): slot
+    <22a>   DW_AT_decl_line   : (data1) 74
+    <22b>   DW_AT_decl_column : (data1) 8
+    <22c>   DW_AT_sibling     : (ref4) <0x2a6>
+ <2><230>: Abbrev Number: 15 (DW_TAG_member)
+    <231>   DW_AT_name        : (strp) (offset: 0x22d5): m_base
+    <235>   DW_AT_decl_file   : (data1) 12
+    <236>   DW_AT_decl_line   : (data1) 75
+    <237>   DW_AT_decl_column : (data1) 20
+    <238>   DW_AT_type        : (ref4) <0x1a44>, PyModuleDef_Base, PyModuleDef_Base
+    <23c>   DW_AT_data_member_location: (data1) 0
+ <2><23d>: Abbrev Number: 15 (DW_TAG_member)
+    <23e>   DW_AT_name        : (strp) (offset: 0x1d91): m_name
+    <242>   DW_AT_decl_file   : (data1) 12
+    <243>   DW_AT_decl_line   : (data1) 76
+    <244>   DW_AT_decl_column : (data1) 15
+    <245>   DW_AT_type        : (ref4) <0xf0>, char
+    <249>   DW_AT_data_member_location: (data1) 40
+ <2><24a>: Abbrev Number: 15 (DW_TAG_member)
+    <24b>   DW_AT_name        : (strp) (offset: 0x139f): m_doc
+    <24f>   DW_AT_decl_file   : (data1) 12
+    <250>   DW_AT_decl_line   : (data1) 77
+    <251>   DW_AT_decl_column : (data1) 15
+    <252>   DW_AT_type        : (ref4) <0xf0>, char
+    <256>   DW_AT_data_member_location: (data1) 48
+ <2><257>: Abbrev Number: 15 (DW_TAG_member)
+    <258>   DW_AT_name        : (strp) (offset: 0xd0a): m_size
+    <25c>   DW_AT_decl_file   : (data1) 12
+    <25d>   DW_AT_decl_line   : (data1) 78
+    <25e>   DW_AT_decl_column : (data1) 14
+    <25f>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
+    <263>   DW_AT_data_member_location: (data1) 56
+ <2><264>: Abbrev Number: 15 (DW_TAG_member)
+    <265>   DW_AT_name        : (strp) (offset: 0x2420): m_methods
+    <269>   DW_AT_decl_file   : (data1) 12
+    <26a>   DW_AT_decl_line   : (data1) 79
+    <26b>   DW_AT_decl_column : (data1) 16
+    <26c>   DW_AT_type        : (ref4) <0x13fb>, PyMethodDef, PyMethodDef
+    <270>   DW_AT_data_member_location: (data1) 64
+ <2><271>: Abbrev Number: 15 (DW_TAG_member)
+    <272>   DW_AT_name        : (strp) (offset: 0x17df): m_slots
+    <276>   DW_AT_decl_file   : (data1) 12
+    <277>   DW_AT_decl_line   : (data1) 80
+    <278>   DW_AT_decl_column : (data1) 21
+    <279>   DW_AT_type        : (ref4) <0x1a50>, PyModuleDef_Slot, PyModuleDef_Slot
+    <27d>   DW_AT_data_member_location: (data1) 72
+ <2><27e>: Abbrev Number: 15 (DW_TAG_member)
+    <27f>   DW_AT_name        : (strp) (offset: 0x1884): m_traverse
+    <283>   DW_AT_decl_file   : (data1) 12
+    <284>   DW_AT_decl_line   : (data1) 81
+    <285>   DW_AT_decl_column : (data1) 16
+    <286>   DW_AT_type        : (ref4) <0xd35>, traverseproc, int
+    <28a>   DW_AT_data_member_location: (data1) 80
+ <2><28b>: Abbrev Number: 15 (DW_TAG_member)
+    <28c>   DW_AT_name        : (strp) (offset: 0x11ab): m_clear
+    <290>   DW_AT_decl_file   : (data1) 12
+    <291>   DW_AT_decl_line   : (data1) 82
+    <292>   DW_AT_decl_column : (data1) 11
+    <293>   DW_AT_type        : (ref4) <0xc2b>, inquiry, int
+    <297>   DW_AT_data_member_location: (data1) 88
+ <2><298>: Abbrev Number: 15 (DW_TAG_member)
+    <299>   DW_AT_name        : (strp) (offset: 0x2233): m_free
+    <29d>   DW_AT_decl_file   : (data1) 12
+    <29e>   DW_AT_decl_line   : (data1) 83
+    <29f>   DW_AT_decl_column : (data1) 12
+    <2a0>   DW_AT_type        : (ref4) <0xd60>, freefunc
+    <2a4>   DW_AT_data_member_location: (data1) 96
+ <2><2a5>: Abbrev Number: 0
+ <1><2a6>: Abbrev Number: 3 (DW_TAG_typedef)
+    <2a7>   DW_AT_name        : (strp) (offset: 0x13e0): PyModuleDef_Slot
+    <2ab>   DW_AT_decl_file   : (data1) 13
+    <2ac>   DW_AT_decl_line   : (data1) 13
+    <2ad>   DW_AT_decl_column : (data1) 33
+    <2ae>   DW_AT_type        : (ref4) <0x2b2>, PyModuleDef_Slot
+ <1><2b2>: Abbrev Number: 14 (DW_TAG_structure_type)
+    <2b3>   DW_AT_name        : (strp) (offset: 0x13e0): PyModuleDef_Slot
+    <2b7>   DW_AT_byte_size   : (data1) 16
     <2b8>   DW_AT_decl_file   : (data1) 12
-    <2b9>   DW_AT_decl_line   : (data1) 61
-    <2ba>   DW_AT_decl_column : (data1) 9
-    <2bb>   DW_AT_type        : (ref4) <0x4f>, int
-    <2bf>   DW_AT_data_member_location: (data1) 0
- <2><2c0>: Abbrev Number: 15 (DW_TAG_member)
-    <2c1>   DW_AT_name        : (strp) (offset: 0xb09): value
-    <2c5>   DW_AT_decl_file   : (data1) 12
-    <2c6>   DW_AT_decl_line   : (data1) 62
-    <2c7>   DW_AT_decl_column : (data1) 11
-    <2c8>   DW_AT_type        : (ref4) <0x88>
-    <2cc>   DW_AT_data_member_location: (data1) 8
- <2><2cd>: Abbrev Number: 0
- <1><2ce>: Abbrev Number: 3 (DW_TAG_typedef)
-    <2cf>   DW_AT_name        : (strp) (offset: 0x187f): PyMethodDef
-    <2d3>   DW_AT_decl_file   : (data1) 13
-    <2d4>   DW_AT_decl_line   : (data1) 14
-    <2d5>   DW_AT_decl_column : (data1) 28
-    <2d6>   DW_AT_type        : (ref4) <0x2da>, PyMethodDef
- <1><2da>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <2db>   DW_AT_name        : (strp) (offset: 0x187f): PyMethodDef
-    <2df>   DW_AT_byte_size   : (data1) 32
-    <2e0>   DW_AT_decl_file   : (data1) 14
-    <2e1>   DW_AT_decl_line   : (data1) 54
-    <2e2>   DW_AT_decl_column : (data1) 8
-    <2e3>   DW_AT_sibling     : (ref4) <0x31c>
- <2><2e7>: Abbrev Number: 15 (DW_TAG_member)
-    <2e8>   DW_AT_name        : (strp) (offset: 0x2491): ml_name
+    <2b9>   DW_AT_decl_line   : (data1) 60
+    <2ba>   DW_AT_decl_column : (data1) 8
+    <2bb>   DW_AT_sibling     : (ref4) <0x2da>
+ <2><2bf>: Abbrev Number: 15 (DW_TAG_member)
+    <2c0>   DW_AT_name        : (strp) (offset: 0x22d0): slot
+    <2c4>   DW_AT_decl_file   : (data1) 12
+    <2c5>   DW_AT_decl_line   : (data1) 61
+    <2c6>   DW_AT_decl_column : (data1) 9
+    <2c7>   DW_AT_type        : (ref4) <0x4f>, int
+    <2cb>   DW_AT_data_member_location: (data1) 0
+ <2><2cc>: Abbrev Number: 15 (DW_TAG_member)
+    <2cd>   DW_AT_name        : (strp) (offset: 0xb19): value
+    <2d1>   DW_AT_decl_file   : (data1) 12
+    <2d2>   DW_AT_decl_line   : (data1) 62
+    <2d3>   DW_AT_decl_column : (data1) 11
+    <2d4>   DW_AT_type        : (ref4) <0x88>
+    <2d8>   DW_AT_data_member_location: (data1) 8
+ <2><2d9>: Abbrev Number: 0
+ <1><2da>: Abbrev Number: 3 (DW_TAG_typedef)
+    <2db>   DW_AT_name        : (strp) (offset: 0x188f): PyMethodDef
+    <2df>   DW_AT_decl_file   : (data1) 13
+    <2e0>   DW_AT_decl_line   : (data1) 14
+    <2e1>   DW_AT_decl_column : (data1) 28
+    <2e2>   DW_AT_type        : (ref4) <0x2e6>, PyMethodDef
+ <1><2e6>: Abbrev Number: 14 (DW_TAG_structure_type)
+    <2e7>   DW_AT_name        : (strp) (offset: 0x188f): PyMethodDef
+    <2eb>   DW_AT_byte_size   : (data1) 32
     <2ec>   DW_AT_decl_file   : (data1) 14
-    <2ed>   DW_AT_decl_line   : (data1) 55
-    <2ee>   DW_AT_decl_column : (data1) 18
-    <2ef>   DW_AT_type        : (ref4) <0xf0>, char
-    <2f3>   DW_AT_data_member_location: (data1) 0
- <2><2f4>: Abbrev Number: 15 (DW_TAG_member)
-    <2f5>   DW_AT_name        : (strp) (offset: 0x13b9): ml_meth
-    <2f9>   DW_AT_decl_file   : (data1) 14
-    <2fa>   DW_AT_decl_line   : (data1) 56
-    <2fb>   DW_AT_decl_column : (data1) 17
-    <2fc>   DW_AT_type        : (ref4) <0x19bb>, PyCFunction, PyObject, _object
-    <300>   DW_AT_data_member_location: (data1) 8
- <2><301>: Abbrev Number: 15 (DW_TAG_member)
-    <302>   DW_AT_name        : (strp) (offset: 0x1223): ml_flags
-    <306>   DW_AT_decl_file   : (data1) 14
-    <307>   DW_AT_decl_line   : (data1) 57
-    <308>   DW_AT_decl_column : (data1) 17
-    <309>   DW_AT_type        : (ref4) <0x4f>, int
-    <30d>   DW_AT_data_member_location: (data1) 16
- <2><30e>: Abbrev Number: 15 (DW_TAG_member)
-    <30f>   DW_AT_name        : (strp) (offset: 0x20aa): ml_doc
-    <313>   DW_AT_decl_file   : (data1) 14
-    <314>   DW_AT_decl_line   : (data1) 59
-    <315>   DW_AT_decl_column : (data1) 18
-    <316>   DW_AT_type        : (ref4) <0xf0>, char
-    <31a>   DW_AT_data_member_location: (data1) 24
- <2><31b>: Abbrev Number: 0
- <1><31c>: Abbrev Number: 3 (DW_TAG_typedef)
-    <31d>   DW_AT_name        : (strp) (offset: 0x1c46): PyGetSetDef
-    <321>   DW_AT_decl_file   : (data1) 13
-    <322>   DW_AT_decl_line   : (data1) 15
-    <323>   DW_AT_decl_column : (data1) 28
-    <324>   DW_AT_type        : (ref4) <0x328>, PyGetSetDef
- <1><328>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <329>   DW_AT_name        : (strp) (offset: 0x1c46): PyGetSetDef
-    <32d>   DW_AT_byte_size   : (data1) 40
-    <32e>   DW_AT_decl_file   : (data1) 15
-    <32f>   DW_AT_decl_line   : (data1) 11
-    <330>   DW_AT_decl_column : (data1) 8
-    <331>   DW_AT_sibling     : (ref4) <0x377>
- <2><335>: Abbrev Number: 15 (DW_TAG_member)
-    <336>   DW_AT_name        : (strp) (offset: 0x2494): name
+    <2ed>   DW_AT_decl_line   : (data1) 54
+    <2ee>   DW_AT_decl_column : (data1) 8
+    <2ef>   DW_AT_sibling     : (ref4) <0x328>
+ <2><2f3>: Abbrev Number: 15 (DW_TAG_member)
+    <2f4>   DW_AT_name        : (strp) (offset: 0x24be): ml_name
+    <2f8>   DW_AT_decl_file   : (data1) 14
+    <2f9>   DW_AT_decl_line   : (data1) 55
+    <2fa>   DW_AT_decl_column : (data1) 18
+    <2fb>   DW_AT_type        : (ref4) <0xf0>, char
+    <2ff>   DW_AT_data_member_location: (data1) 0
+ <2><300>: Abbrev Number: 15 (DW_TAG_member)
+    <301>   DW_AT_name        : (strp) (offset: 0x13c9): ml_meth
+    <305>   DW_AT_decl_file   : (data1) 14
+    <306>   DW_AT_decl_line   : (data1) 56
+    <307>   DW_AT_decl_column : (data1) 17
+    <308>   DW_AT_type        : (ref4) <0x19c7>, PyCFunction, PyObject, _object
+    <30c>   DW_AT_data_member_location: (data1) 8
+ <2><30d>: Abbrev Number: 15 (DW_TAG_member)
+    <30e>   DW_AT_name        : (strp) (offset: 0x1233): ml_flags
+    <312>   DW_AT_decl_file   : (data1) 14
+    <313>   DW_AT_decl_line   : (data1) 57
+    <314>   DW_AT_decl_column : (data1) 17
+    <315>   DW_AT_type        : (ref4) <0x4f>, int
+    <319>   DW_AT_data_member_location: (data1) 16
+ <2><31a>: Abbrev Number: 15 (DW_TAG_member)
+    <31b>   DW_AT_name        : (strp) (offset: 0x20d2): ml_doc
+    <31f>   DW_AT_decl_file   : (data1) 14
+    <320>   DW_AT_decl_line   : (data1) 59
+    <321>   DW_AT_decl_column : (data1) 18
+    <322>   DW_AT_type        : (ref4) <0xf0>, char
+    <326>   DW_AT_data_member_location: (data1) 24
+ <2><327>: Abbrev Number: 0
+ <1><328>: Abbrev Number: 3 (DW_TAG_typedef)
+    <329>   DW_AT_name        : (strp) (offset: 0x1c60): PyGetSetDef
+    <32d>   DW_AT_decl_file   : (data1) 13
+    <32e>   DW_AT_decl_line   : (data1) 15
+    <32f>   DW_AT_decl_column : (data1) 28
+    <330>   DW_AT_type        : (ref4) <0x334>, PyGetSetDef
+ <1><334>: Abbrev Number: 14 (DW_TAG_structure_type)
+    <335>   DW_AT_name        : (strp) (offset: 0x1c60): PyGetSetDef
+    <339>   DW_AT_byte_size   : (data1) 40
     <33a>   DW_AT_decl_file   : (data1) 15
-    <33b>   DW_AT_decl_line   : (data1) 12
-    <33c>   DW_AT_decl_column : (data1) 17
-    <33d>   DW_AT_type        : (ref4) <0xf0>, char
-    <341>   DW_AT_data_member_location: (data1) 0
- <2><342>: Abbrev Number: 16 (DW_TAG_member)
-    <343>   DW_AT_name        : (string) get
-    <347>   DW_AT_decl_file   : (data1) 15
-    <348>   DW_AT_decl_line   : (data1) 13
-    <349>   DW_AT_decl_column : (data1) 12
-    <34a>   DW_AT_type        : (ref4) <0x1d9b>, getter, PyObject, _object
-    <34e>   DW_AT_data_member_location: (data1) 8
- <2><34f>: Abbrev Number: 16 (DW_TAG_member)
-    <350>   DW_AT_name        : (string) set
-    <354>   DW_AT_decl_file   : (data1) 15
-    <355>   DW_AT_decl_line   : (data1) 14
-    <356>   DW_AT_decl_column : (data1) 12
-    <357>   DW_AT_type        : (ref4) <0x1da7>, setter, int
-    <35b>   DW_AT_data_member_location: (data1) 16
- <2><35c>: Abbrev Number: 16 (DW_TAG_member)
-    <35d>   DW_AT_name        : (string) doc
-    <361>   DW_AT_decl_file   : (data1) 15
-    <362>   DW_AT_decl_line   : (data1) 15
-    <363>   DW_AT_decl_column : (data1) 17
-    <364>   DW_AT_type        : (ref4) <0xf0>, char
-    <368>   DW_AT_data_member_location: (data1) 24
- <2><369>: Abbrev Number: 15 (DW_TAG_member)
-    <36a>   DW_AT_name        : (strp) (offset: 0xeee): closure
-    <36e>   DW_AT_decl_file   : (data1) 15
-    <36f>   DW_AT_decl_line   : (data1) 16
-    <370>   DW_AT_decl_column : (data1) 11
-    <371>   DW_AT_type        : (ref4) <0x88>
-    <375>   DW_AT_data_member_location: (data1) 32
- <2><376>: Abbrev Number: 0
- <1><377>: Abbrev Number: 3 (DW_TAG_typedef)
-    <378>   DW_AT_name        : (strp) (offset: 0x940): PyMemberDef
-    <37c>   DW_AT_decl_file   : (data1) 13
-    <37d>   DW_AT_decl_line   : (data1) 16
-    <37e>   DW_AT_decl_column : (data1) 28
-    <37f>   DW_AT_type        : (ref4) <0x383>, PyMemberDef
- <1><383>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <384>   DW_AT_name        : (strp) (offset: 0x940): PyMemberDef
-    <388>   DW_AT_byte_size   : (data1) 40
-    <389>   DW_AT_decl_file   : (data1) 16
-    <38a>   DW_AT_decl_line   : (data1) 18
-    <38b>   DW_AT_decl_column : (data1) 8
-    <38c>   DW_AT_sibling     : (ref4) <0x3d2>
- <2><390>: Abbrev Number: 15 (DW_TAG_member)
-    <391>   DW_AT_name        : (strp) (offset: 0x2494): name
+    <33b>   DW_AT_decl_line   : (data1) 11
+    <33c>   DW_AT_decl_column : (data1) 8
+    <33d>   DW_AT_sibling     : (ref4) <0x383>
+ <2><341>: Abbrev Number: 15 (DW_TAG_member)
+    <342>   DW_AT_name        : (strp) (offset: 0x24c1): name
+    <346>   DW_AT_decl_file   : (data1) 15
+    <347>   DW_AT_decl_line   : (data1) 12
+    <348>   DW_AT_decl_column : (data1) 17
+    <349>   DW_AT_type        : (ref4) <0xf0>, char
+    <34d>   DW_AT_data_member_location: (data1) 0
+ <2><34e>: Abbrev Number: 16 (DW_TAG_member)
+    <34f>   DW_AT_name        : (string) get
+    <353>   DW_AT_decl_file   : (data1) 15
+    <354>   DW_AT_decl_line   : (data1) 13
+    <355>   DW_AT_decl_column : (data1) 12
+    <356>   DW_AT_type        : (ref4) <0x1da7>, getter, PyObject, _object
+    <35a>   DW_AT_data_member_location: (data1) 8
+ <2><35b>: Abbrev Number: 16 (DW_TAG_member)
+    <35c>   DW_AT_name        : (string) set
+    <360>   DW_AT_decl_file   : (data1) 15
+    <361>   DW_AT_decl_line   : (data1) 14
+    <362>   DW_AT_decl_column : (data1) 12
+    <363>   DW_AT_type        : (ref4) <0x1db3>, setter, int
+    <367>   DW_AT_data_member_location: (data1) 16
+ <2><368>: Abbrev Number: 16 (DW_TAG_member)
+    <369>   DW_AT_name        : (string) doc
+    <36d>   DW_AT_decl_file   : (data1) 15
+    <36e>   DW_AT_decl_line   : (data1) 15
+    <36f>   DW_AT_decl_column : (data1) 17
+    <370>   DW_AT_type        : (ref4) <0xf0>, char
+    <374>   DW_AT_data_member_location: (data1) 24
+ <2><375>: Abbrev Number: 15 (DW_TAG_member)
+    <376>   DW_AT_name        : (strp) (offset: 0xefe): closure
+    <37a>   DW_AT_decl_file   : (data1) 15
+    <37b>   DW_AT_decl_line   : (data1) 16
+    <37c>   DW_AT_decl_column : (data1) 11
+    <37d>   DW_AT_type        : (ref4) <0x88>
+    <381>   DW_AT_data_member_location: (data1) 32
+ <2><382>: Abbrev Number: 0
+ <1><383>: Abbrev Number: 3 (DW_TAG_typedef)
+    <384>   DW_AT_name        : (strp) (offset: 0x950): PyMemberDef
+    <388>   DW_AT_decl_file   : (data1) 13
+    <389>   DW_AT_decl_line   : (data1) 16
+    <38a>   DW_AT_decl_column : (data1) 28
+    <38b>   DW_AT_type        : (ref4) <0x38f>, PyMemberDef
+ <1><38f>: Abbrev Number: 14 (DW_TAG_structure_type)
+    <390>   DW_AT_name        : (strp) (offset: 0x950): PyMemberDef
+    <394>   DW_AT_byte_size   : (data1) 40
     <395>   DW_AT_decl_file   : (data1) 16
-    <396>   DW_AT_decl_line   : (data1) 19
-    <397>   DW_AT_decl_column : (data1) 17
-    <398>   DW_AT_type        : (ref4) <0xf0>, char
-    <39c>   DW_AT_data_member_location: (data1) 0
- <2><39d>: Abbrev Number: 15 (DW_TAG_member)
-    <39e>   DW_AT_name        : (strp) (offset: 0x2201): type
-    <3a2>   DW_AT_decl_file   : (data1) 16
-    <3a3>   DW_AT_decl_line   : (data1) 20
-    <3a4>   DW_AT_decl_column : (data1) 9
-    <3a5>   DW_AT_type        : (ref4) <0x4f>, int
-    <3a9>   DW_AT_data_member_location: (data1) 8
- <2><3aa>: Abbrev Number: 15 (DW_TAG_member)
-    <3ab>   DW_AT_name        : (strp) (offset: 0x902): offset
-    <3af>   DW_AT_decl_file   : (data1) 16
-    <3b0>   DW_AT_decl_line   : (data1) 21
-    <3b1>   DW_AT_decl_column : (data1) 16
-    <3b2>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
-    <3b6>   DW_AT_data_member_location: (data1) 16
- <2><3b7>: Abbrev Number: 15 (DW_TAG_member)
-    <3b8>   DW_AT_name        : (strp) (offset: 0x1226): flags
-    <3bc>   DW_AT_decl_file   : (data1) 16
-    <3bd>   DW_AT_decl_line   : (data1) 22
-    <3be>   DW_AT_decl_column : (data1) 9
-    <3bf>   DW_AT_type        : (ref4) <0x4f>, int
-    <3c3>   DW_AT_data_member_location: (data1) 24
- <2><3c4>: Abbrev Number: 16 (DW_TAG_member)
-    <3c5>   DW_AT_name        : (string) doc
-    <3c9>   DW_AT_decl_file   : (data1) 16
-    <3ca>   DW_AT_decl_line   : (data1) 23
-    <3cb>   DW_AT_decl_column : (data1) 17
-    <3cc>   DW_AT_type        : (ref4) <0xf0>, char
-    <3d0>   DW_AT_data_member_location: (data1) 32
- <2><3d1>: Abbrev Number: 0
- <1><3d2>: Abbrev Number: 3 (DW_TAG_typedef)
-    <3d3>   DW_AT_name        : (strp) (offset: 0x13f6): PyObject
-    <3d7>   DW_AT_decl_file   : (data1) 13
-    <3d8>   DW_AT_decl_line   : (data1) 18
-    <3d9>   DW_AT_decl_column : (data1) 24
-    <3da>   DW_AT_type        : (ref4) <0x3de>, _object
- <1><3de>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <3df>   DW_AT_name        : (strp) (offset: 0x50b): _object
-    <3e3>   DW_AT_byte_size   : (data1) 16
-    <3e4>   DW_AT_decl_file   : (data1) 2
-    <3e5>   DW_AT_decl_line   : (data1) 100
-    <3e6>   DW_AT_decl_column : (data1) 8
-    <3e7>   DW_AT_sibling     : (ref4) <0x406>
- <2><3eb>: Abbrev Number: 15 (DW_TAG_member)
-    <3ec>   DW_AT_name        : (strp) (offset: 0x574): ob_refcnt
+    <396>   DW_AT_decl_line   : (data1) 18
+    <397>   DW_AT_decl_column : (data1) 8
+    <398>   DW_AT_sibling     : (ref4) <0x3de>
+ <2><39c>: Abbrev Number: 15 (DW_TAG_member)
+    <39d>   DW_AT_name        : (strp) (offset: 0x24c1): name
+    <3a1>   DW_AT_decl_file   : (data1) 16
+    <3a2>   DW_AT_decl_line   : (data1) 19
+    <3a3>   DW_AT_decl_column : (data1) 17
+    <3a4>   DW_AT_type        : (ref4) <0xf0>, char
+    <3a8>   DW_AT_data_member_location: (data1) 0
+ <2><3a9>: Abbrev Number: 15 (DW_TAG_member)
+    <3aa>   DW_AT_name        : (strp) (offset: 0x222e): type
+    <3ae>   DW_AT_decl_file   : (data1) 16
+    <3af>   DW_AT_decl_line   : (data1) 20
+    <3b0>   DW_AT_decl_column : (data1) 9
+    <3b1>   DW_AT_type        : (ref4) <0x4f>, int
+    <3b5>   DW_AT_data_member_location: (data1) 8
+ <2><3b6>: Abbrev Number: 15 (DW_TAG_member)
+    <3b7>   DW_AT_name        : (strp) (offset: 0x912): offset
+    <3bb>   DW_AT_decl_file   : (data1) 16
+    <3bc>   DW_AT_decl_line   : (data1) 21
+    <3bd>   DW_AT_decl_column : (data1) 16
+    <3be>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
+    <3c2>   DW_AT_data_member_location: (data1) 16
+ <2><3c3>: Abbrev Number: 15 (DW_TAG_member)
+    <3c4>   DW_AT_name        : (strp) (offset: 0x1236): flags
+    <3c8>   DW_AT_decl_file   : (data1) 16
+    <3c9>   DW_AT_decl_line   : (data1) 22
+    <3ca>   DW_AT_decl_column : (data1) 9
+    <3cb>   DW_AT_type        : (ref4) <0x4f>, int
+    <3cf>   DW_AT_data_member_location: (data1) 24
+ <2><3d0>: Abbrev Number: 16 (DW_TAG_member)
+    <3d1>   DW_AT_name        : (string) doc
+    <3d5>   DW_AT_decl_file   : (data1) 16
+    <3d6>   DW_AT_decl_line   : (data1) 23
+    <3d7>   DW_AT_decl_column : (data1) 17
+    <3d8>   DW_AT_type        : (ref4) <0xf0>, char
+    <3dc>   DW_AT_data_member_location: (data1) 32
+ <2><3dd>: Abbrev Number: 0
+ <1><3de>: Abbrev Number: 3 (DW_TAG_typedef)
+    <3df>   DW_AT_name        : (strp) (offset: 0x1406): PyObject
+    <3e3>   DW_AT_decl_file   : (data1) 13
+    <3e4>   DW_AT_decl_line   : (data1) 18
+    <3e5>   DW_AT_decl_column : (data1) 24
+    <3e6>   DW_AT_type        : (ref4) <0x3ea>, _object
+ <1><3ea>: Abbrev Number: 14 (DW_TAG_structure_type)
+    <3eb>   DW_AT_name        : (strp) (offset: 0x51b): _object
+    <3ef>   DW_AT_byte_size   : (data1) 16
     <3f0>   DW_AT_decl_file   : (data1) 2
-    <3f1>   DW_AT_decl_line   : (data1) 102
-    <3f2>   DW_AT_decl_column : (data1) 16
-    <3f3>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
-    <3f7>   DW_AT_data_member_location: (data1) 0
- <2><3f8>: Abbrev Number: 15 (DW_TAG_member)
-    <3f9>   DW_AT_name        : (strp) (offset: 0x21fe): ob_type
-    <3fd>   DW_AT_decl_file   : (data1) 2
-    <3fe>   DW_AT_decl_line   : (data1) 103
-    <3ff>   DW_AT_decl_column : (data1) 19
-    <400>   DW_AT_type        : (ref4) <0xb77>, PyTypeObject, _typeobject
-    <404>   DW_AT_data_member_location: (data1) 8
- <2><405>: Abbrev Number: 0
- <1><406>: Abbrev Number: 3 (DW_TAG_typedef)
-    <407>   DW_AT_name        : (strp) (offset: 0xd68): PyLongObject
-    <40b>   DW_AT_decl_file   : (data1) 13
-    <40c>   DW_AT_decl_line   : (data1) 19
-    <40d>   DW_AT_decl_column : (data1) 28
-    <40e>   DW_AT_type        : (ref4) <0x412>, _longobject
- <1><412>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <413>   DW_AT_name        : (strp) (offset: 0x1e9d): _longobject
-    <417>   DW_AT_byte_size   : (data1) 32
-    <418>   DW_AT_decl_file   : (data1) 17
-    <419>   DW_AT_decl_line   : (data1) 82
-    <41a>   DW_AT_decl_column : (data1) 8
-    <41b>   DW_AT_sibling     : (ref4) <0x43a>
- <2><41f>: Abbrev Number: 15 (DW_TAG_member)
-    <420>   DW_AT_name        : (strp) (offset: 0x387): ob_base
+    <3f1>   DW_AT_decl_line   : (data1) 100
+    <3f2>   DW_AT_decl_column : (data1) 8
+    <3f3>   DW_AT_sibling     : (ref4) <0x412>
+ <2><3f7>: Abbrev Number: 15 (DW_TAG_member)
+    <3f8>   DW_AT_name        : (strp) (offset: 0x584): ob_refcnt
+    <3fc>   DW_AT_decl_file   : (data1) 2
+    <3fd>   DW_AT_decl_line   : (data1) 102
+    <3fe>   DW_AT_decl_column : (data1) 16
+    <3ff>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
+    <403>   DW_AT_data_member_location: (data1) 0
+ <2><404>: Abbrev Number: 15 (DW_TAG_member)
+    <405>   DW_AT_name        : (strp) (offset: 0x222b): ob_type
+    <409>   DW_AT_decl_file   : (data1) 2
+    <40a>   DW_AT_decl_line   : (data1) 103
+    <40b>   DW_AT_decl_column : (data1) 19
+    <40c>   DW_AT_type        : (ref4) <0xb83>, PyTypeObject, _typeobject
+    <410>   DW_AT_data_member_location: (data1) 8
+ <2><411>: Abbrev Number: 0
+ <1><412>: Abbrev Number: 3 (DW_TAG_typedef)
+    <413>   DW_AT_name        : (strp) (offset: 0xd78): PyLongObject
+    <417>   DW_AT_decl_file   : (data1) 13
+    <418>   DW_AT_decl_line   : (data1) 19
+    <419>   DW_AT_decl_column : (data1) 28
+    <41a>   DW_AT_type        : (ref4) <0x41e>, _longobject
+ <1><41e>: Abbrev Number: 14 (DW_TAG_structure_type)
+    <41f>   DW_AT_name        : (strp) (offset: 0x1eb7): _longobject
+    <423>   DW_AT_byte_size   : (data1) 32
     <424>   DW_AT_decl_file   : (data1) 17
-    <425>   DW_AT_decl_line   : (data1) 83
-    <426>   DW_AT_decl_column : (data1) 5
-    <427>   DW_AT_type        : (ref4) <0xba1>, PyVarObject
-    <42b>   DW_AT_data_member_location: (data1) 0
- <2><42c>: Abbrev Number: 15 (DW_TAG_member)
-    <42d>   DW_AT_name        : (strp) (offset: 0xb34): ob_digit
-    <431>   DW_AT_decl_file   : (data1) 17
-    <432>   DW_AT_decl_line   : (data1) 84
-    <433>   DW_AT_decl_column : (data1) 11
-    <434>   DW_AT_type        : (ref4) <0x1772>, digit, uint32_t, unsigned int
-    <438>   DW_AT_data_member_location: (data1) 24
- <2><439>: Abbrev Number: 0
- <1><43a>: Abbrev Number: 3 (DW_TAG_typedef)
-    <43b>   DW_AT_name        : (strp) (offset: 0xae6): PyTypeObject
-    <43f>   DW_AT_decl_file   : (data1) 13
-    <440>   DW_AT_decl_line   : (data1) 20
-    <441>   DW_AT_decl_column : (data1) 28
-    <442>   DW_AT_type        : (ref4) <0x446>, _typeobject
- <1><446>: Abbrev Number: 17 (DW_TAG_structure_type)
-    <447>   DW_AT_name        : (strp) (offset: 0x10dd): _typeobject
-    <44b>   DW_AT_byte_size   : (data2) 408
-    <44d>   DW_AT_decl_file   : (data1) 18
-    <44e>   DW_AT_decl_line   : (data1) 148
-    <44f>   DW_AT_decl_column : (data1) 8
-    <450>   DW_AT_sibling     : (ref4) <0x6e5>
- <2><454>: Abbrev Number: 15 (DW_TAG_member)
-    <455>   DW_AT_name        : (strp) (offset: 0x387): ob_base
+    <425>   DW_AT_decl_line   : (data1) 82
+    <426>   DW_AT_decl_column : (data1) 8
+    <427>   DW_AT_sibling     : (ref4) <0x446>
+ <2><42b>: Abbrev Number: 15 (DW_TAG_member)
+    <42c>   DW_AT_name        : (strp) (offset: 0x397): ob_base
+    <430>   DW_AT_decl_file   : (data1) 17
+    <431>   DW_AT_decl_line   : (data1) 83
+    <432>   DW_AT_decl_column : (data1) 5
+    <433>   DW_AT_type        : (ref4) <0xbad>, PyVarObject
+    <437>   DW_AT_data_member_location: (data1) 0
+ <2><438>: Abbrev Number: 15 (DW_TAG_member)
+    <439>   DW_AT_name        : (strp) (offset: 0xb44): ob_digit
+    <43d>   DW_AT_decl_file   : (data1) 17
+    <43e>   DW_AT_decl_line   : (data1) 84
+    <43f>   DW_AT_decl_column : (data1) 11
+    <440>   DW_AT_type        : (ref4) <0x177e>, digit, uint32_t, unsigned int
+    <444>   DW_AT_data_member_location: (data1) 24
+ <2><445>: Abbrev Number: 0
+ <1><446>: Abbrev Number: 3 (DW_TAG_typedef)
+    <447>   DW_AT_name        : (strp) (offset: 0xaf6): PyTypeObject
+    <44b>   DW_AT_decl_file   : (data1) 13
+    <44c>   DW_AT_decl_line   : (data1) 20
+    <44d>   DW_AT_decl_column : (data1) 28
+    <44e>   DW_AT_type        : (ref4) <0x452>, _typeobject
+ <1><452>: Abbrev Number: 17 (DW_TAG_structure_type)
+    <453>   DW_AT_name        : (strp) (offset: 0x10ed): _typeobject
+    <457>   DW_AT_byte_size   : (data2) 408
     <459>   DW_AT_decl_file   : (data1) 18
-    <45a>   DW_AT_decl_line   : (data1) 149
-    <45b>   DW_AT_decl_column : (data1) 5
-    <45c>   DW_AT_type        : (ref4) <0xba1>, PyVarObject
-    <460>   DW_AT_data_member_location: (data1) 0
- <2><461>: Abbrev Number: 15 (DW_TAG_member)
-    <462>   DW_AT_name        : (strp) (offset: 0x4b3): tp_name
-    <466>   DW_AT_decl_file   : (data1) 18
-    <467>   DW_AT_decl_line   : (data1) 150
-    <468>   DW_AT_decl_column : (data1) 17
-    <469>   DW_AT_type        : (ref4) <0xf0>, char
-    <46d>   DW_AT_data_member_location: (data1) 24
- <2><46e>: Abbrev Number: 15 (DW_TAG_member)
-    <46f>   DW_AT_name        : (strp) (offset: 0x1d5b): tp_basicsize
-    <473>   DW_AT_decl_file   : (data1) 18
-    <474>   DW_AT_decl_line   : (data1) 151
-    <475>   DW_AT_decl_column : (data1) 16
-    <476>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
-    <47a>   DW_AT_data_member_location: (data1) 32
- <2><47b>: Abbrev Number: 15 (DW_TAG_member)
-    <47c>   DW_AT_name        : (strp) (offset: 0x1e4c): tp_itemsize
-    <480>   DW_AT_decl_file   : (data1) 18
-    <481>   DW_AT_decl_line   : (data1) 151
-    <482>   DW_AT_decl_column : (data1) 30
-    <483>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
-    <487>   DW_AT_data_member_location: (data1) 40
- <2><488>: Abbrev Number: 15 (DW_TAG_member)
-    <489>   DW_AT_name        : (strp) (offset: 0x18e): tp_dealloc
-    <48d>   DW_AT_decl_file   : (data1) 18
-    <48e>   DW_AT_decl_line   : (data1) 155
-    <48f>   DW_AT_decl_column : (data1) 16
-    <490>   DW_AT_type        : (ref4) <0xd71>, destructor
-    <494>   DW_AT_data_member_location: (data1) 48
- <2><495>: Abbrev Number: 15 (DW_TAG_member)
-    <496>   DW_AT_name        : (strp) (offset: 0x8f4): tp_vectorcall_offset
-    <49a>   DW_AT_decl_file   : (data1) 18
-    <49b>   DW_AT_decl_line   : (data1) 156
-    <49c>   DW_AT_decl_column : (data1) 16
-    <49d>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
-    <4a1>   DW_AT_data_member_location: (data1) 56
- <2><4a2>: Abbrev Number: 15 (DW_TAG_member)
-    <4a3>   DW_AT_name        : (strp) (offset: 0x1cd4): tp_getattr
-    <4a7>   DW_AT_decl_file   : (data1) 18
-    <4a8>   DW_AT_decl_line   : (data1) 157
-    <4a9>   DW_AT_decl_column : (data1) 17
-    <4aa>   DW_AT_type        : (ref4) <0xd8e>, getattrfunc, PyObject, _object
-    <4ae>   DW_AT_data_member_location: (data1) 64
- <2><4af>: Abbrev Number: 15 (DW_TAG_member)
-    <4b0>   DW_AT_name        : (strp) (offset: 0xe27): tp_setattr
-    <4b4>   DW_AT_decl_file   : (data1) 18
-    <4b5>   DW_AT_decl_line   : (data1) 158
-    <4b6>   DW_AT_decl_column : (data1) 17
-    <4b7>   DW_AT_type        : (ref4) <0xdc0>, setattrfunc, int
-    <4bb>   DW_AT_data_member_location: (data1) 72
- <2><4bc>: Abbrev Number: 15 (DW_TAG_member)
-    <4bd>   DW_AT_name        : (strp) (offset: 0x19db): tp_as_async
-    <4c1>   DW_AT_decl_file   : (data1) 18
-    <4c2>   DW_AT_decl_line   : (data1) 159
-    <4c3>   DW_AT_decl_column : (data1) 21
-    <4c4>   DW_AT_type        : (ref4) <0x13d1>, PyAsyncMethods
-    <4c8>   DW_AT_data_member_location: (data1) 80
- <2><4c9>: Abbrev Number: 15 (DW_TAG_member)
-    <4ca>   DW_AT_name        : (strp) (offset: 0x214): tp_repr
-    <4ce>   DW_AT_decl_file   : (data1) 18
-    <4cf>   DW_AT_decl_line   : (data1) 161
-    <4d0>   DW_AT_decl_column : (data1) 14
-    <4d1>   DW_AT_type        : (ref4) <0xdf7>, reprfunc, PyObject, _object
-    <4d5>   DW_AT_data_member_location: (data1) 88
- <2><4d6>: Abbrev Number: 15 (DW_TAG_member)
-    <4d7>   DW_AT_name        : (strp) (offset: 0x1f5c): tp_as_number
-    <4db>   DW_AT_decl_file   : (data1) 18
-    <4dc>   DW_AT_decl_line   : (data1) 165
-    <4dd>   DW_AT_decl_column : (data1) 22
-    <4de>   DW_AT_type        : (ref4) <0x13d7>, PyNumberMethods
-    <4e2>   DW_AT_data_member_location: (data1) 96
- <2><4e3>: Abbrev Number: 15 (DW_TAG_member)
-    <4e4>   DW_AT_name        : (strp) (offset: 0x205): tp_as_sequence
-    <4e8>   DW_AT_decl_file   : (data1) 18
-    <4e9>   DW_AT_decl_line   : (data1) 166
-    <4ea>   DW_AT_decl_column : (data1) 24
-    <4eb>   DW_AT_type        : (ref4) <0x13dd>, PySequenceMethods
-    <4ef>   DW_AT_data_member_location: (data1) 104
- <2><4f0>: Abbrev Number: 15 (DW_TAG_member)
-    <4f1>   DW_AT_name        : (strp) (offset: 0xdf1): tp_as_mapping
-    <4f5>   DW_AT_decl_file   : (data1) 18
-    <4f6>   DW_AT_decl_line   : (data1) 167
-    <4f7>   DW_AT_decl_column : (data1) 23
-    <4f8>   DW_AT_type        : (ref4) <0x13e3>, PyMappingMethods
-    <4fc>   DW_AT_data_member_location: (data1) 112
- <2><4fd>: Abbrev Number: 15 (DW_TAG_member)
-    <4fe>   DW_AT_name        : (strp) (offset: 0xa19): tp_hash
-    <502>   DW_AT_decl_file   : (data1) 18
-    <503>   DW_AT_decl_line   : (data1) 171
-    <504>   DW_AT_decl_column : (data1) 14
-    <505>   DW_AT_type        : (ref4) <0xe03>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, long int
-    <509>   DW_AT_data_member_location: (data1) 120
- <2><50a>: Abbrev Number: 15 (DW_TAG_member)
-    <50b>   DW_AT_name        : (strp) (offset: 0x1464): tp_call
-    <50f>   DW_AT_decl_file   : (data1) 18
-    <510>   DW_AT_decl_line   : (data1) 172
-    <511>   DW_AT_decl_column : (data1) 17
-    <512>   DW_AT_type        : (ref4) <0xbf4>, ternaryfunc, PyObject, _object
-    <516>   DW_AT_data_member_location: (data1) 128
- <2><517>: Abbrev Number: 15 (DW_TAG_member)
-    <518>   DW_AT_name        : (strp) (offset: 0xf1d): tp_str
-    <51c>   DW_AT_decl_file   : (data1) 18
-    <51d>   DW_AT_decl_line   : (data1) 173
-    <51e>   DW_AT_decl_column : (data1) 14
-    <51f>   DW_AT_type        : (ref4) <0xdf7>, reprfunc, PyObject, _object
-    <523>   DW_AT_data_member_location: (data1) 136
- <2><524>: Abbrev Number: 15 (DW_TAG_member)
-    <525>   DW_AT_name        : (strp) (offset: 0xb7c): tp_getattro
-    <529>   DW_AT_decl_file   : (data1) 18
-    <52a>   DW_AT_decl_line   : (data1) 174
-    <52b>   DW_AT_decl_column : (data1) 18
-    <52c>   DW_AT_type        : (ref4) <0xdb4>, getattrofunc, PyObject, _object
-    <530>   DW_AT_data_member_location: (data1) 144
- <2><531>: Abbrev Number: 15 (DW_TAG_member)
-    <532>   DW_AT_name        : (strp) (offset: 0x178e): tp_setattro
-    <536>   DW_AT_decl_file   : (data1) 18
-    <537>   DW_AT_decl_line   : (data1) 175
-    <538>   DW_AT_decl_column : (data1) 18
-    <539>   DW_AT_type        : (ref4) <0xdeb>, setattrofunc, int
-    <53d>   DW_AT_data_member_location: (data1) 152
- <2><53e>: Abbrev Number: 15 (DW_TAG_member)
-    <53f>   DW_AT_name        : (strp) (offset: 0x1bc0): tp_as_buffer
-    <543>   DW_AT_decl_file   : (data1) 18
-    <544>   DW_AT_decl_line   : (data1) 178
-    <545>   DW_AT_decl_column : (data1) 20
-    <546>   DW_AT_type        : (ref4) <0x13e9>, PyBufferProcs
-    <54a>   DW_AT_data_member_location: (data1) 160
- <2><54b>: Abbrev Number: 15 (DW_TAG_member)
-    <54c>   DW_AT_name        : (strp) (offset: 0x112b): tp_flags
-    <550>   DW_AT_decl_file   : (data1) 18
-    <551>   DW_AT_decl_line   : (data1) 181
-    <552>   DW_AT_decl_column : (data1) 19
-    <553>   DW_AT_type        : (ref4) <0x62>, long unsigned int
-    <557>   DW_AT_data_member_location: (data1) 168
- <2><558>: Abbrev Number: 15 (DW_TAG_member)
-    <559>   DW_AT_name        : (strp) (offset: 0x76c): tp_doc
-    <55d>   DW_AT_decl_file   : (data1) 18
-    <55e>   DW_AT_decl_line   : (data1) 183
-    <55f>   DW_AT_decl_column : (data1) 17
-    <560>   DW_AT_type        : (ref4) <0xf0>, char
-    <564>   DW_AT_data_member_location: (data1) 176
- <2><565>: Abbrev Number: 15 (DW_TAG_member)
-    <566>   DW_AT_name        : (strp) (offset: 0xd5c): tp_traverse
-    <56a>   DW_AT_decl_file   : (data1) 18
-    <56b>   DW_AT_decl_line   : (data1) 187
-    <56c>   DW_AT_decl_column : (data1) 18
-    <56d>   DW_AT_type        : (ref4) <0xd29>, traverseproc, int
-    <571>   DW_AT_data_member_location: (data1) 184
- <2><572>: Abbrev Number: 15 (DW_TAG_member)
-    <573>   DW_AT_name        : (strp) (offset: 0x1448): tp_clear
-    <577>   DW_AT_decl_file   : (data1) 18
-    <578>   DW_AT_decl_line   : (data1) 190
-    <579>   DW_AT_decl_column : (data1) 13
-    <57a>   DW_AT_type        : (ref4) <0xc1f>, inquiry, int
-    <57e>   DW_AT_data_member_location: (data1) 192
- <2><57f>: Abbrev Number: 15 (DW_TAG_member)
-    <580>   DW_AT_name        : (strp) (offset: 0x140): tp_richcompare
-    <584>   DW_AT_decl_file   : (data1) 18
-    <585>   DW_AT_decl_line   : (data1) 194
-    <586>   DW_AT_decl_column : (data1) 17
-    <587>   DW_AT_type        : (ref4) <0xe24>, richcmpfunc, PyObject, _object
-    <58b>   DW_AT_data_member_location: (data1) 200
- <2><58c>: Abbrev Number: 15 (DW_TAG_member)
-    <58d>   DW_AT_name        : (strp) (offset: 0x479): tp_weaklistoffset
-    <591>   DW_AT_decl_file   : (data1) 18
-    <592>   DW_AT_decl_line   : (data1) 197
-    <593>   DW_AT_decl_column : (data1) 16
-    <594>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
-    <598>   DW_AT_data_member_location: (data1) 208
- <2><599>: Abbrev Number: 15 (DW_TAG_member)
-    <59a>   DW_AT_name        : (strp) (offset: 0x611): tp_iter
-    <59e>   DW_AT_decl_file   : (data1) 18
-    <59f>   DW_AT_decl_line   : (data1) 200
-    <5a0>   DW_AT_decl_column : (data1) 17
-    <5a1>   DW_AT_type        : (ref4) <0xe4f>, getiterfunc, PyObject, _object
-    <5a5>   DW_AT_data_member_location: (data1) 216
- <2><5a6>: Abbrev Number: 15 (DW_TAG_member)
-    <5a7>   DW_AT_name        : (strp) (offset: 0x143c): tp_iternext
-    <5ab>   DW_AT_decl_file   : (data1) 18
-    <5ac>   DW_AT_decl_line   : (data1) 201
-    <5ad>   DW_AT_decl_column : (data1) 18
-    <5ae>   DW_AT_type        : (ref4) <0xe5b>, iternextfunc, PyObject, _object
-    <5b2>   DW_AT_data_member_location: (data1) 224
- <2><5b3>: Abbrev Number: 15 (DW_TAG_member)
-    <5b4>   DW_AT_name        : (strp) (offset: 0x35f): tp_methods
-    <5b8>   DW_AT_decl_file   : (data1) 18
-    <5b9>   DW_AT_decl_line   : (data1) 204
-    <5ba>   DW_AT_decl_column : (data1) 18
-    <5bb>   DW_AT_type        : (ref4) <0x13ef>, PyMethodDef, PyMethodDef
-    <5bf>   DW_AT_data_member_location: (data1) 232
- <2><5c0>: Abbrev Number: 15 (DW_TAG_member)
-    <5c1>   DW_AT_name        : (strp) (offset: 0x1619): tp_members
-    <5c5>   DW_AT_decl_file   : (data1) 18
-    <5c6>   DW_AT_decl_line   : (data1) 205
-    <5c7>   DW_AT_decl_column : (data1) 18
-    <5c8>   DW_AT_type        : (ref4) <0x13f5>, PyMemberDef, PyMemberDef
-    <5cc>   DW_AT_data_member_location: (data1) 240
- <2><5cd>: Abbrev Number: 15 (DW_TAG_member)
-    <5ce>   DW_AT_name        : (strp) (offset: 0x1b5d): tp_getset
-    <5d2>   DW_AT_decl_file   : (data1) 18
-    <5d3>   DW_AT_decl_line   : (data1) 206
-    <5d4>   DW_AT_decl_column : (data1) 18
-    <5d5>   DW_AT_type        : (ref4) <0x13fb>, PyGetSetDef, PyGetSetDef
-    <5d9>   DW_AT_data_member_location: (data1) 248
- <2><5da>: Abbrev Number: 18 (DW_TAG_member)
-    <5db>   DW_AT_name        : (strp) (offset: 0x8db): tp_base
-    <5df>   DW_AT_decl_file   : (data1) 18
-    <5e0>   DW_AT_decl_line   : (data1) 208
-    <5e1>   DW_AT_decl_column : (data1) 19
-    <5e2>   DW_AT_type        : (ref4) <0xb77>, PyTypeObject, _typeobject
-    <5e6>   DW_AT_data_member_location: (data2) 256
- <2><5e8>: Abbrev Number: 18 (DW_TAG_member)
-    <5e9>   DW_AT_name        : (strp) (offset: 0xcdd): tp_dict
-    <5ed>   DW_AT_decl_file   : (data1) 18
-    <5ee>   DW_AT_decl_line   : (data1) 209
-    <5ef>   DW_AT_decl_column : (data1) 15
-    <5f0>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <5f4>   DW_AT_data_member_location: (data2) 264
- <2><5f6>: Abbrev Number: 18 (DW_TAG_member)
-    <5f7>   DW_AT_name        : (strp) (offset: 0x2290): tp_descr_get
-    <5fb>   DW_AT_decl_file   : (data1) 18
-    <5fc>   DW_AT_decl_line   : (data1) 210
-    <5fd>   DW_AT_decl_column : (data1) 18
-    <5fe>   DW_AT_type        : (ref4) <0xe67>, descrgetfunc, PyObject, _object
-    <602>   DW_AT_data_member_location: (data2) 272
- <2><604>: Abbrev Number: 18 (DW_TAG_member)
-    <605>   DW_AT_name        : (strp) (offset: 0xc56): tp_descr_set
-    <609>   DW_AT_decl_file   : (data1) 18
-    <60a>   DW_AT_decl_line   : (data1) 211
-    <60b>   DW_AT_decl_column : (data1) 18
-    <60c>   DW_AT_type        : (ref4) <0xe73>, descrsetfunc, int
-    <610>   DW_AT_data_member_location: (data2) 280
- <2><612>: Abbrev Number: 18 (DW_TAG_member)
-    <613>   DW_AT_name        : (strp) (offset: 0x24a5): tp_dictoffset
-    <617>   DW_AT_decl_file   : (data1) 18
-    <618>   DW_AT_decl_line   : (data1) 212
-    <619>   DW_AT_decl_column : (data1) 16
-    <61a>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
-    <61e>   DW_AT_data_member_location: (data2) 288
- <2><620>: Abbrev Number: 18 (DW_TAG_member)
-    <621>   DW_AT_name        : (strp) (offset: 0x38f): tp_init
-    <625>   DW_AT_decl_file   : (data1) 18
-    <626>   DW_AT_decl_line   : (data1) 213
-    <627>   DW_AT_decl_column : (data1) 14
-    <628>   DW_AT_type        : (ref4) <0xe7f>, initproc, int
-    <62c>   DW_AT_data_member_location: (data2) 296
- <2><62e>: Abbrev Number: 18 (DW_TAG_member)
-    <62f>   DW_AT_name        : (strp) (offset: 0x1a0e): tp_alloc
-    <633>   DW_AT_decl_file   : (data1) 18
-    <634>   DW_AT_decl_line   : (data1) 214
-    <635>   DW_AT_decl_column : (data1) 15
-    <636>   DW_AT_type        : (ref4) <0xeb6>, allocfunc, PyObject, _object
-    <63a>   DW_AT_data_member_location: (data2) 304
- <2><63c>: Abbrev Number: 18 (DW_TAG_member)
-    <63d>   DW_AT_name        : (strp) (offset: 0x21e6): tp_new
-    <641>   DW_AT_decl_file   : (data1) 18
-    <642>   DW_AT_decl_line   : (data1) 215
-    <643>   DW_AT_decl_column : (data1) 13
-    <644>   DW_AT_type        : (ref4) <0xe8b>, newfunc, PyObject, _object
-    <648>   DW_AT_data_member_location: (data2) 312
- <2><64a>: Abbrev Number: 18 (DW_TAG_member)
-    <64b>   DW_AT_name        : (strp) (offset: 0x878): tp_free
-    <64f>   DW_AT_decl_file   : (data1) 18
-    <650>   DW_AT_decl_line   : (data1) 216
-    <651>   DW_AT_decl_column : (data1) 14
-    <652>   DW_AT_type        : (ref4) <0xd54>, freefunc
-    <656>   DW_AT_data_member_location: (data2) 320
- <2><658>: Abbrev Number: 18 (DW_TAG_member)
-    <659>   DW_AT_name        : (strp) (offset: 0x48b): tp_is_gc
-    <65d>   DW_AT_decl_file   : (data1) 18
-    <65e>   DW_AT_decl_line   : (data1) 217
-    <65f>   DW_AT_decl_column : (data1) 13
-    <660>   DW_AT_type        : (ref4) <0xc1f>, inquiry, int
-    <664>   DW_AT_data_member_location: (data2) 328
- <2><666>: Abbrev Number: 18 (DW_TAG_member)
-    <667>   DW_AT_name        : (strp) (offset: 0x345): tp_bases
-    <66b>   DW_AT_decl_file   : (data1) 18
-    <66c>   DW_AT_decl_line   : (data1) 218
-    <66d>   DW_AT_decl_column : (data1) 15
-    <66e>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <672>   DW_AT_data_member_location: (data2) 336
- <2><674>: Abbrev Number: 18 (DW_TAG_member)
-    <675>   DW_AT_name        : (strp) (offset: 0x51a): tp_mro
-    <679>   DW_AT_decl_file   : (data1) 18
-    <67a>   DW_AT_decl_line   : (data1) 219
-    <67b>   DW_AT_decl_column : (data1) 15
-    <67c>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <680>   DW_AT_data_member_location: (data2) 344
- <2><682>: Abbrev Number: 18 (DW_TAG_member)
-    <683>   DW_AT_name        : (strp) (offset: 0x1d52): tp_cache
-    <687>   DW_AT_decl_file   : (data1) 18
-    <688>   DW_AT_decl_line   : (data1) 220
-    <689>   DW_AT_decl_column : (data1) 15
-    <68a>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <68e>   DW_AT_data_member_location: (data2) 352
- <2><690>: Abbrev Number: 18 (DW_TAG_member)
-    <691>   DW_AT_name        : (strp) (offset: 0x2419): tp_subclasses
-    <695>   DW_AT_decl_file   : (data1) 18
-    <696>   DW_AT_decl_line   : (data1) 221
-    <697>   DW_AT_decl_column : (data1) 15
-    <698>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <69c>   DW_AT_data_member_location: (data2) 360
- <2><69e>: Abbrev Number: 18 (DW_TAG_member)
-    <69f>   DW_AT_name        : (strp) (offset: 0x1b8c): tp_weaklist
-    <6a3>   DW_AT_decl_file   : (data1) 18
-    <6a4>   DW_AT_decl_line   : (data1) 222
-    <6a5>   DW_AT_decl_column : (data1) 15
-    <6a6>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <6aa>   DW_AT_data_member_location: (data2) 368
- <2><6ac>: Abbrev Number: 18 (DW_TAG_member)
-    <6ad>   DW_AT_name        : (strp) (offset: 0x2143): tp_del
-    <6b1>   DW_AT_decl_file   : (data1) 18
-    <6b2>   DW_AT_decl_line   : (data1) 223
-    <6b3>   DW_AT_decl_column : (data1) 16
-    <6b4>   DW_AT_type        : (ref4) <0xd71>, destructor
-    <6b8>   DW_AT_data_member_location: (data2) 376
- <2><6ba>: Abbrev Number: 18 (DW_TAG_member)
-    <6bb>   DW_AT_name        : (strp) (offset: 0x1caf): tp_version_tag
-    <6bf>   DW_AT_decl_file   : (data1) 18
-    <6c0>   DW_AT_decl_line   : (data1) 226
-    <6c1>   DW_AT_decl_column : (data1) 18
-    <6c2>   DW_AT_type        : (ref4) <0x7c>, unsigned int
-    <6c6>   DW_AT_data_member_location: (data2) 384
- <2><6c8>: Abbrev Number: 18 (DW_TAG_member)
-    <6c9>   DW_AT_name        : (strp) (offset: 0x2055): tp_finalize
-    <6cd>   DW_AT_decl_file   : (data1) 18
-    <6ce>   DW_AT_decl_line   : (data1) 228
-    <6cf>   DW_AT_decl_column : (data1) 16
-    <6d0>   DW_AT_type        : (ref4) <0xd71>, destructor
-    <6d4>   DW_AT_data_member_location: (data2) 392
- <2><6d6>: Abbrev Number: 18 (DW_TAG_member)
-    <6d7>   DW_AT_name        : (strp) (offset: 0x1bef): tp_vectorcall
-    <6db>   DW_AT_decl_file   : (data1) 18
-    <6dc>   DW_AT_decl_line   : (data1) 229
-    <6dd>   DW_AT_decl_column : (data1) 20
-    <6de>   DW_AT_type        : (ref4) <0x102c>, vectorcallfunc, PyObject, _object
-    <6e2>   DW_AT_data_member_location: (data2) 400
- <2><6e4>: Abbrev Number: 0
- <1><6e5>: Abbrev Number: 3 (DW_TAG_typedef)
-    <6e6>   DW_AT_name        : (strp) (offset: 0xd1e): PyCodeObject
-    <6ea>   DW_AT_decl_file   : (data1) 13
-    <6eb>   DW_AT_decl_line   : (data1) 21
-    <6ec>   DW_AT_decl_column : (data1) 29
-    <6ed>   DW_AT_type        : (ref4) <0x6f1>, PyCodeObject
- <1><6f1>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <6f2>   DW_AT_name        : (strp) (offset: 0xd1e): PyCodeObject
-    <6f6>   DW_AT_byte_size   : (data1) 192
-    <6f7>   DW_AT_decl_file   : (data1) 19
-    <6f8>   DW_AT_decl_line   : (data1) 103
-    <6f9>   DW_AT_decl_column : (data1) 8
-    <6fa>   DW_AT_sibling     : (ref4) <0x878>
- <2><6fe>: Abbrev Number: 15 (DW_TAG_member)
-    <6ff>   DW_AT_name        : (strp) (offset: 0x387): ob_base
+    <45a>   DW_AT_decl_line   : (data1) 148
+    <45b>   DW_AT_decl_column : (data1) 8
+    <45c>   DW_AT_sibling     : (ref4) <0x6f1>
+ <2><460>: Abbrev Number: 15 (DW_TAG_member)
+    <461>   DW_AT_name        : (strp) (offset: 0x397): ob_base
+    <465>   DW_AT_decl_file   : (data1) 18
+    <466>   DW_AT_decl_line   : (data1) 149
+    <467>   DW_AT_decl_column : (data1) 5
+    <468>   DW_AT_type        : (ref4) <0xbad>, PyVarObject
+    <46c>   DW_AT_data_member_location: (data1) 0
+ <2><46d>: Abbrev Number: 15 (DW_TAG_member)
+    <46e>   DW_AT_name        : (strp) (offset: 0x4c3): tp_name
+    <472>   DW_AT_decl_file   : (data1) 18
+    <473>   DW_AT_decl_line   : (data1) 150
+    <474>   DW_AT_decl_column : (data1) 17
+    <475>   DW_AT_type        : (ref4) <0xf0>, char
+    <479>   DW_AT_data_member_location: (data1) 24
+ <2><47a>: Abbrev Number: 15 (DW_TAG_member)
+    <47b>   DW_AT_name        : (strp) (offset: 0x1d75): tp_basicsize
+    <47f>   DW_AT_decl_file   : (data1) 18
+    <480>   DW_AT_decl_line   : (data1) 151
+    <481>   DW_AT_decl_column : (data1) 16
+    <482>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
+    <486>   DW_AT_data_member_location: (data1) 32
+ <2><487>: Abbrev Number: 15 (DW_TAG_member)
+    <488>   DW_AT_name        : (strp) (offset: 0x1e66): tp_itemsize
+    <48c>   DW_AT_decl_file   : (data1) 18
+    <48d>   DW_AT_decl_line   : (data1) 151
+    <48e>   DW_AT_decl_column : (data1) 30
+    <48f>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
+    <493>   DW_AT_data_member_location: (data1) 40
+ <2><494>: Abbrev Number: 15 (DW_TAG_member)
+    <495>   DW_AT_name        : (strp) (offset: 0x18e): tp_dealloc
+    <499>   DW_AT_decl_file   : (data1) 18
+    <49a>   DW_AT_decl_line   : (data1) 155
+    <49b>   DW_AT_decl_column : (data1) 16
+    <49c>   DW_AT_type        : (ref4) <0xd7d>, destructor
+    <4a0>   DW_AT_data_member_location: (data1) 48
+ <2><4a1>: Abbrev Number: 15 (DW_TAG_member)
+    <4a2>   DW_AT_name        : (strp) (offset: 0x904): tp_vectorcall_offset
+    <4a6>   DW_AT_decl_file   : (data1) 18
+    <4a7>   DW_AT_decl_line   : (data1) 156
+    <4a8>   DW_AT_decl_column : (data1) 16
+    <4a9>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
+    <4ad>   DW_AT_data_member_location: (data1) 56
+ <2><4ae>: Abbrev Number: 15 (DW_TAG_member)
+    <4af>   DW_AT_name        : (strp) (offset: 0x1cee): tp_getattr
+    <4b3>   DW_AT_decl_file   : (data1) 18
+    <4b4>   DW_AT_decl_line   : (data1) 157
+    <4b5>   DW_AT_decl_column : (data1) 17
+    <4b6>   DW_AT_type        : (ref4) <0xd9a>, getattrfunc, PyObject, _object
+    <4ba>   DW_AT_data_member_location: (data1) 64
+ <2><4bb>: Abbrev Number: 15 (DW_TAG_member)
+    <4bc>   DW_AT_name        : (strp) (offset: 0xe37): tp_setattr
+    <4c0>   DW_AT_decl_file   : (data1) 18
+    <4c1>   DW_AT_decl_line   : (data1) 158
+    <4c2>   DW_AT_decl_column : (data1) 17
+    <4c3>   DW_AT_type        : (ref4) <0xdcc>, setattrfunc, int
+    <4c7>   DW_AT_data_member_location: (data1) 72
+ <2><4c8>: Abbrev Number: 15 (DW_TAG_member)
+    <4c9>   DW_AT_name        : (strp) (offset: 0x19eb): tp_as_async
+    <4cd>   DW_AT_decl_file   : (data1) 18
+    <4ce>   DW_AT_decl_line   : (data1) 159
+    <4cf>   DW_AT_decl_column : (data1) 21
+    <4d0>   DW_AT_type        : (ref4) <0x13dd>, PyAsyncMethods
+    <4d4>   DW_AT_data_member_location: (data1) 80
+ <2><4d5>: Abbrev Number: 15 (DW_TAG_member)
+    <4d6>   DW_AT_name        : (strp) (offset: 0x224): tp_repr
+    <4da>   DW_AT_decl_file   : (data1) 18
+    <4db>   DW_AT_decl_line   : (data1) 161
+    <4dc>   DW_AT_decl_column : (data1) 14
+    <4dd>   DW_AT_type        : (ref4) <0xe03>, reprfunc, PyObject, _object
+    <4e1>   DW_AT_data_member_location: (data1) 88
+ <2><4e2>: Abbrev Number: 15 (DW_TAG_member)
+    <4e3>   DW_AT_name        : (strp) (offset: 0x1f76): tp_as_number
+    <4e7>   DW_AT_decl_file   : (data1) 18
+    <4e8>   DW_AT_decl_line   : (data1) 165
+    <4e9>   DW_AT_decl_column : (data1) 22
+    <4ea>   DW_AT_type        : (ref4) <0x13e3>, PyNumberMethods
+    <4ee>   DW_AT_data_member_location: (data1) 96
+ <2><4ef>: Abbrev Number: 15 (DW_TAG_member)
+    <4f0>   DW_AT_name        : (strp) (offset: 0x215): tp_as_sequence
+    <4f4>   DW_AT_decl_file   : (data1) 18
+    <4f5>   DW_AT_decl_line   : (data1) 166
+    <4f6>   DW_AT_decl_column : (data1) 24
+    <4f7>   DW_AT_type        : (ref4) <0x13e9>, PySequenceMethods
+    <4fb>   DW_AT_data_member_location: (data1) 104
+ <2><4fc>: Abbrev Number: 15 (DW_TAG_member)
+    <4fd>   DW_AT_name        : (strp) (offset: 0xe01): tp_as_mapping
+    <501>   DW_AT_decl_file   : (data1) 18
+    <502>   DW_AT_decl_line   : (data1) 167
+    <503>   DW_AT_decl_column : (data1) 23
+    <504>   DW_AT_type        : (ref4) <0x13ef>, PyMappingMethods
+    <508>   DW_AT_data_member_location: (data1) 112
+ <2><509>: Abbrev Number: 15 (DW_TAG_member)
+    <50a>   DW_AT_name        : (strp) (offset: 0xa29): tp_hash
+    <50e>   DW_AT_decl_file   : (data1) 18
+    <50f>   DW_AT_decl_line   : (data1) 171
+    <510>   DW_AT_decl_column : (data1) 14
+    <511>   DW_AT_type        : (ref4) <0xe0f>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, long int
+    <515>   DW_AT_data_member_location: (data1) 120
+ <2><516>: Abbrev Number: 15 (DW_TAG_member)
+    <517>   DW_AT_name        : (strp) (offset: 0x1474): tp_call
+    <51b>   DW_AT_decl_file   : (data1) 18
+    <51c>   DW_AT_decl_line   : (data1) 172
+    <51d>   DW_AT_decl_column : (data1) 17
+    <51e>   DW_AT_type        : (ref4) <0xc00>, ternaryfunc, PyObject, _object
+    <522>   DW_AT_data_member_location: (data1) 128
+ <2><523>: Abbrev Number: 15 (DW_TAG_member)
+    <524>   DW_AT_name        : (strp) (offset: 0xf2d): tp_str
+    <528>   DW_AT_decl_file   : (data1) 18
+    <529>   DW_AT_decl_line   : (data1) 173
+    <52a>   DW_AT_decl_column : (data1) 14
+    <52b>   DW_AT_type        : (ref4) <0xe03>, reprfunc, PyObject, _object
+    <52f>   DW_AT_data_member_location: (data1) 136
+ <2><530>: Abbrev Number: 15 (DW_TAG_member)
+    <531>   DW_AT_name        : (strp) (offset: 0xb8c): tp_getattro
+    <535>   DW_AT_decl_file   : (data1) 18
+    <536>   DW_AT_decl_line   : (data1) 174
+    <537>   DW_AT_decl_column : (data1) 18
+    <538>   DW_AT_type        : (ref4) <0xdc0>, getattrofunc, PyObject, _object
+    <53c>   DW_AT_data_member_location: (data1) 144
+ <2><53d>: Abbrev Number: 15 (DW_TAG_member)
+    <53e>   DW_AT_name        : (strp) (offset: 0x179e): tp_setattro
+    <542>   DW_AT_decl_file   : (data1) 18
+    <543>   DW_AT_decl_line   : (data1) 175
+    <544>   DW_AT_decl_column : (data1) 18
+    <545>   DW_AT_type        : (ref4) <0xdf7>, setattrofunc, int
+    <549>   DW_AT_data_member_location: (data1) 152
+ <2><54a>: Abbrev Number: 15 (DW_TAG_member)
+    <54b>   DW_AT_name        : (strp) (offset: 0x1bda): tp_as_buffer
+    <54f>   DW_AT_decl_file   : (data1) 18
+    <550>   DW_AT_decl_line   : (data1) 178
+    <551>   DW_AT_decl_column : (data1) 20
+    <552>   DW_AT_type        : (ref4) <0x13f5>, PyBufferProcs
+    <556>   DW_AT_data_member_location: (data1) 160
+ <2><557>: Abbrev Number: 15 (DW_TAG_member)
+    <558>   DW_AT_name        : (strp) (offset: 0x113b): tp_flags
+    <55c>   DW_AT_decl_file   : (data1) 18
+    <55d>   DW_AT_decl_line   : (data1) 181
+    <55e>   DW_AT_decl_column : (data1) 19
+    <55f>   DW_AT_type        : (ref4) <0x62>, long unsigned int
+    <563>   DW_AT_data_member_location: (data1) 168
+ <2><564>: Abbrev Number: 15 (DW_TAG_member)
+    <565>   DW_AT_name        : (strp) (offset: 0x77c): tp_doc
+    <569>   DW_AT_decl_file   : (data1) 18
+    <56a>   DW_AT_decl_line   : (data1) 183
+    <56b>   DW_AT_decl_column : (data1) 17
+    <56c>   DW_AT_type        : (ref4) <0xf0>, char
+    <570>   DW_AT_data_member_location: (data1) 176
+ <2><571>: Abbrev Number: 15 (DW_TAG_member)
+    <572>   DW_AT_name        : (strp) (offset: 0xd6c): tp_traverse
+    <576>   DW_AT_decl_file   : (data1) 18
+    <577>   DW_AT_decl_line   : (data1) 187
+    <578>   DW_AT_decl_column : (data1) 18
+    <579>   DW_AT_type        : (ref4) <0xd35>, traverseproc, int
+    <57d>   DW_AT_data_member_location: (data1) 184
+ <2><57e>: Abbrev Number: 15 (DW_TAG_member)
+    <57f>   DW_AT_name        : (strp) (offset: 0x1458): tp_clear
+    <583>   DW_AT_decl_file   : (data1) 18
+    <584>   DW_AT_decl_line   : (data1) 190
+    <585>   DW_AT_decl_column : (data1) 13
+    <586>   DW_AT_type        : (ref4) <0xc2b>, inquiry, int
+    <58a>   DW_AT_data_member_location: (data1) 192
+ <2><58b>: Abbrev Number: 15 (DW_TAG_member)
+    <58c>   DW_AT_name        : (strp) (offset: 0x140): tp_richcompare
+    <590>   DW_AT_decl_file   : (data1) 18
+    <591>   DW_AT_decl_line   : (data1) 194
+    <592>   DW_AT_decl_column : (data1) 17
+    <593>   DW_AT_type        : (ref4) <0xe30>, richcmpfunc, PyObject, _object
+    <597>   DW_AT_data_member_location: (data1) 200
+ <2><598>: Abbrev Number: 15 (DW_TAG_member)
+    <599>   DW_AT_name        : (strp) (offset: 0x489): tp_weaklistoffset
+    <59d>   DW_AT_decl_file   : (data1) 18
+    <59e>   DW_AT_decl_line   : (data1) 197
+    <59f>   DW_AT_decl_column : (data1) 16
+    <5a0>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
+    <5a4>   DW_AT_data_member_location: (data1) 208
+ <2><5a5>: Abbrev Number: 15 (DW_TAG_member)
+    <5a6>   DW_AT_name        : (strp) (offset: 0x621): tp_iter
+    <5aa>   DW_AT_decl_file   : (data1) 18
+    <5ab>   DW_AT_decl_line   : (data1) 200
+    <5ac>   DW_AT_decl_column : (data1) 17
+    <5ad>   DW_AT_type        : (ref4) <0xe5b>, getiterfunc, PyObject, _object
+    <5b1>   DW_AT_data_member_location: (data1) 216
+ <2><5b2>: Abbrev Number: 15 (DW_TAG_member)
+    <5b3>   DW_AT_name        : (strp) (offset: 0x144c): tp_iternext
+    <5b7>   DW_AT_decl_file   : (data1) 18
+    <5b8>   DW_AT_decl_line   : (data1) 201
+    <5b9>   DW_AT_decl_column : (data1) 18
+    <5ba>   DW_AT_type        : (ref4) <0xe67>, iternextfunc, PyObject, _object
+    <5be>   DW_AT_data_member_location: (data1) 224
+ <2><5bf>: Abbrev Number: 15 (DW_TAG_member)
+    <5c0>   DW_AT_name        : (strp) (offset: 0x36f): tp_methods
+    <5c4>   DW_AT_decl_file   : (data1) 18
+    <5c5>   DW_AT_decl_line   : (data1) 204
+    <5c6>   DW_AT_decl_column : (data1) 18
+    <5c7>   DW_AT_type        : (ref4) <0x13fb>, PyMethodDef, PyMethodDef
+    <5cb>   DW_AT_data_member_location: (data1) 232
+ <2><5cc>: Abbrev Number: 15 (DW_TAG_member)
+    <5cd>   DW_AT_name        : (strp) (offset: 0x1629): tp_members
+    <5d1>   DW_AT_decl_file   : (data1) 18
+    <5d2>   DW_AT_decl_line   : (data1) 205
+    <5d3>   DW_AT_decl_column : (data1) 18
+    <5d4>   DW_AT_type        : (ref4) <0x1401>, PyMemberDef, PyMemberDef
+    <5d8>   DW_AT_data_member_location: (data1) 240
+ <2><5d9>: Abbrev Number: 15 (DW_TAG_member)
+    <5da>   DW_AT_name        : (strp) (offset: 0x1b77): tp_getset
+    <5de>   DW_AT_decl_file   : (data1) 18
+    <5df>   DW_AT_decl_line   : (data1) 206
+    <5e0>   DW_AT_decl_column : (data1) 18
+    <5e1>   DW_AT_type        : (ref4) <0x1407>, PyGetSetDef, PyGetSetDef
+    <5e5>   DW_AT_data_member_location: (data1) 248
+ <2><5e6>: Abbrev Number: 18 (DW_TAG_member)
+    <5e7>   DW_AT_name        : (strp) (offset: 0x8eb): tp_base
+    <5eb>   DW_AT_decl_file   : (data1) 18
+    <5ec>   DW_AT_decl_line   : (data1) 208
+    <5ed>   DW_AT_decl_column : (data1) 19
+    <5ee>   DW_AT_type        : (ref4) <0xb83>, PyTypeObject, _typeobject
+    <5f2>   DW_AT_data_member_location: (data2) 256
+ <2><5f4>: Abbrev Number: 18 (DW_TAG_member)
+    <5f5>   DW_AT_name        : (strp) (offset: 0xced): tp_dict
+    <5f9>   DW_AT_decl_file   : (data1) 18
+    <5fa>   DW_AT_decl_line   : (data1) 209
+    <5fb>   DW_AT_decl_column : (data1) 15
+    <5fc>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <600>   DW_AT_data_member_location: (data2) 264
+ <2><602>: Abbrev Number: 18 (DW_TAG_member)
+    <603>   DW_AT_name        : (strp) (offset: 0x22bd): tp_descr_get
+    <607>   DW_AT_decl_file   : (data1) 18
+    <608>   DW_AT_decl_line   : (data1) 210
+    <609>   DW_AT_decl_column : (data1) 18
+    <60a>   DW_AT_type        : (ref4) <0xe73>, descrgetfunc, PyObject, _object
+    <60e>   DW_AT_data_member_location: (data2) 272
+ <2><610>: Abbrev Number: 18 (DW_TAG_member)
+    <611>   DW_AT_name        : (strp) (offset: 0xc66): tp_descr_set
+    <615>   DW_AT_decl_file   : (data1) 18
+    <616>   DW_AT_decl_line   : (data1) 211
+    <617>   DW_AT_decl_column : (data1) 18
+    <618>   DW_AT_type        : (ref4) <0xe7f>, descrsetfunc, int
+    <61c>   DW_AT_data_member_location: (data2) 280
+ <2><61e>: Abbrev Number: 18 (DW_TAG_member)
+    <61f>   DW_AT_name        : (strp) (offset: 0x24d2): tp_dictoffset
+    <623>   DW_AT_decl_file   : (data1) 18
+    <624>   DW_AT_decl_line   : (data1) 212
+    <625>   DW_AT_decl_column : (data1) 16
+    <626>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
+    <62a>   DW_AT_data_member_location: (data2) 288
+ <2><62c>: Abbrev Number: 18 (DW_TAG_member)
+    <62d>   DW_AT_name        : (strp) (offset: 0x39f): tp_init
+    <631>   DW_AT_decl_file   : (data1) 18
+    <632>   DW_AT_decl_line   : (data1) 213
+    <633>   DW_AT_decl_column : (data1) 14
+    <634>   DW_AT_type        : (ref4) <0xe8b>, initproc, int
+    <638>   DW_AT_data_member_location: (data2) 296
+ <2><63a>: Abbrev Number: 18 (DW_TAG_member)
+    <63b>   DW_AT_name        : (strp) (offset: 0x1a1e): tp_alloc
+    <63f>   DW_AT_decl_file   : (data1) 18
+    <640>   DW_AT_decl_line   : (data1) 214
+    <641>   DW_AT_decl_column : (data1) 15
+    <642>   DW_AT_type        : (ref4) <0xec2>, allocfunc, PyObject, _object
+    <646>   DW_AT_data_member_location: (data2) 304
+ <2><648>: Abbrev Number: 18 (DW_TAG_member)
+    <649>   DW_AT_name        : (strp) (offset: 0x2213): tp_new
+    <64d>   DW_AT_decl_file   : (data1) 18
+    <64e>   DW_AT_decl_line   : (data1) 215
+    <64f>   DW_AT_decl_column : (data1) 13
+    <650>   DW_AT_type        : (ref4) <0xe97>, newfunc, PyObject, _object
+    <654>   DW_AT_data_member_location: (data2) 312
+ <2><656>: Abbrev Number: 18 (DW_TAG_member)
+    <657>   DW_AT_name        : (strp) (offset: 0x888): tp_free
+    <65b>   DW_AT_decl_file   : (data1) 18
+    <65c>   DW_AT_decl_line   : (data1) 216
+    <65d>   DW_AT_decl_column : (data1) 14
+    <65e>   DW_AT_type        : (ref4) <0xd60>, freefunc
+    <662>   DW_AT_data_member_location: (data2) 320
+ <2><664>: Abbrev Number: 18 (DW_TAG_member)
+    <665>   DW_AT_name        : (strp) (offset: 0x49b): tp_is_gc
+    <669>   DW_AT_decl_file   : (data1) 18
+    <66a>   DW_AT_decl_line   : (data1) 217
+    <66b>   DW_AT_decl_column : (data1) 13
+    <66c>   DW_AT_type        : (ref4) <0xc2b>, inquiry, int
+    <670>   DW_AT_data_member_location: (data2) 328
+ <2><672>: Abbrev Number: 18 (DW_TAG_member)
+    <673>   DW_AT_name        : (strp) (offset: 0x355): tp_bases
+    <677>   DW_AT_decl_file   : (data1) 18
+    <678>   DW_AT_decl_line   : (data1) 218
+    <679>   DW_AT_decl_column : (data1) 15
+    <67a>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <67e>   DW_AT_data_member_location: (data2) 336
+ <2><680>: Abbrev Number: 18 (DW_TAG_member)
+    <681>   DW_AT_name        : (strp) (offset: 0x52a): tp_mro
+    <685>   DW_AT_decl_file   : (data1) 18
+    <686>   DW_AT_decl_line   : (data1) 219
+    <687>   DW_AT_decl_column : (data1) 15
+    <688>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <68c>   DW_AT_data_member_location: (data2) 344
+ <2><68e>: Abbrev Number: 18 (DW_TAG_member)
+    <68f>   DW_AT_name        : (strp) (offset: 0x1d6c): tp_cache
+    <693>   DW_AT_decl_file   : (data1) 18
+    <694>   DW_AT_decl_line   : (data1) 220
+    <695>   DW_AT_decl_column : (data1) 15
+    <696>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <69a>   DW_AT_data_member_location: (data2) 352
+ <2><69c>: Abbrev Number: 18 (DW_TAG_member)
+    <69d>   DW_AT_name        : (strp) (offset: 0x2446): tp_subclasses
+    <6a1>   DW_AT_decl_file   : (data1) 18
+    <6a2>   DW_AT_decl_line   : (data1) 221
+    <6a3>   DW_AT_decl_column : (data1) 15
+    <6a4>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <6a8>   DW_AT_data_member_location: (data2) 360
+ <2><6aa>: Abbrev Number: 18 (DW_TAG_member)
+    <6ab>   DW_AT_name        : (strp) (offset: 0x1ba6): tp_weaklist
+    <6af>   DW_AT_decl_file   : (data1) 18
+    <6b0>   DW_AT_decl_line   : (data1) 222
+    <6b1>   DW_AT_decl_column : (data1) 15
+    <6b2>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <6b6>   DW_AT_data_member_location: (data2) 368
+ <2><6b8>: Abbrev Number: 18 (DW_TAG_member)
+    <6b9>   DW_AT_name        : (strp) (offset: 0x216b): tp_del
+    <6bd>   DW_AT_decl_file   : (data1) 18
+    <6be>   DW_AT_decl_line   : (data1) 223
+    <6bf>   DW_AT_decl_column : (data1) 16
+    <6c0>   DW_AT_type        : (ref4) <0xd7d>, destructor
+    <6c4>   DW_AT_data_member_location: (data2) 376
+ <2><6c6>: Abbrev Number: 18 (DW_TAG_member)
+    <6c7>   DW_AT_name        : (strp) (offset: 0x1cc9): tp_version_tag
+    <6cb>   DW_AT_decl_file   : (data1) 18
+    <6cc>   DW_AT_decl_line   : (data1) 226
+    <6cd>   DW_AT_decl_column : (data1) 18
+    <6ce>   DW_AT_type        : (ref4) <0x7c>, unsigned int
+    <6d2>   DW_AT_data_member_location: (data2) 384
+ <2><6d4>: Abbrev Number: 18 (DW_TAG_member)
+    <6d5>   DW_AT_name        : (strp) (offset: 0x207d): tp_finalize
+    <6d9>   DW_AT_decl_file   : (data1) 18
+    <6da>   DW_AT_decl_line   : (data1) 228
+    <6db>   DW_AT_decl_column : (data1) 16
+    <6dc>   DW_AT_type        : (ref4) <0xd7d>, destructor
+    <6e0>   DW_AT_data_member_location: (data2) 392
+ <2><6e2>: Abbrev Number: 18 (DW_TAG_member)
+    <6e3>   DW_AT_name        : (strp) (offset: 0x1c09): tp_vectorcall
+    <6e7>   DW_AT_decl_file   : (data1) 18
+    <6e8>   DW_AT_decl_line   : (data1) 229
+    <6e9>   DW_AT_decl_column : (data1) 20
+    <6ea>   DW_AT_type        : (ref4) <0x1038>, vectorcallfunc, PyObject, _object
+    <6ee>   DW_AT_data_member_location: (data2) 400
+ <2><6f0>: Abbrev Number: 0
+ <1><6f1>: Abbrev Number: 3 (DW_TAG_typedef)
+    <6f2>   DW_AT_name        : (strp) (offset: 0xd2e): PyCodeObject
+    <6f6>   DW_AT_decl_file   : (data1) 13
+    <6f7>   DW_AT_decl_line   : (data1) 21
+    <6f8>   DW_AT_decl_column : (data1) 29
+    <6f9>   DW_AT_type        : (ref4) <0x6fd>, PyCodeObject
+ <1><6fd>: Abbrev Number: 14 (DW_TAG_structure_type)
+    <6fe>   DW_AT_name        : (strp) (offset: 0xd2e): PyCodeObject
+    <702>   DW_AT_byte_size   : (data1) 192
     <703>   DW_AT_decl_file   : (data1) 19
     <704>   DW_AT_decl_line   : (data1) 103
-    <705>   DW_AT_decl_column : (data1) 21
-    <706>   DW_AT_type        : (ref4) <0xba1>, PyVarObject
-    <70a>   DW_AT_data_member_location: (data1) 0
- <2><70b>: Abbrev Number: 15 (DW_TAG_member)
-    <70c>   DW_AT_name        : (strp) (offset: 0x114e): co_consts
-    <710>   DW_AT_decl_file   : (data1) 19
-    <711>   DW_AT_decl_line   : (data1) 103
-    <712>   DW_AT_decl_column : (data1) 21
-    <713>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <717>   DW_AT_data_member_location: (data1) 24
- <2><718>: Abbrev Number: 15 (DW_TAG_member)
-    <719>   DW_AT_name        : (strp) (offset: 0x12d9): co_names
-    <71d>   DW_AT_decl_file   : (data1) 19
-    <71e>   DW_AT_decl_line   : (data1) 103
-    <71f>   DW_AT_decl_column : (data1) 21
-    <720>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <724>   DW_AT_data_member_location: (data1) 32
- <2><725>: Abbrev Number: 15 (DW_TAG_member)
-    <726>   DW_AT_name        : (strp) (offset: 0xd4a): co_exceptiontable
-    <72a>   DW_AT_decl_file   : (data1) 19
-    <72b>   DW_AT_decl_line   : (data1) 103
-    <72c>   DW_AT_decl_column : (data1) 21
-    <72d>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <731>   DW_AT_data_member_location: (data1) 40
- <2><732>: Abbrev Number: 15 (DW_TAG_member)
-    <733>   DW_AT_name        : (strp) (offset: 0x2304): co_flags
-    <737>   DW_AT_decl_file   : (data1) 19
-    <738>   DW_AT_decl_line   : (data1) 103
-    <739>   DW_AT_decl_column : (data1) 21
-    <73a>   DW_AT_type        : (ref4) <0x4f>, int
-    <73e>   DW_AT_data_member_location: (data1) 48
- <2><73f>: Abbrev Number: 15 (DW_TAG_member)
-    <740>   DW_AT_name        : (strp) (offset: 0x1b29): co_warmup
-    <744>   DW_AT_decl_file   : (data1) 19
-    <745>   DW_AT_decl_line   : (data1) 103
-    <746>   DW_AT_decl_column : (data1) 21
-    <747>   DW_AT_type        : (ref4) <0x168>, short int
-    <74b>   DW_AT_data_member_location: (data1) 52
- <2><74c>: Abbrev Number: 15 (DW_TAG_member)
-    <74d>   DW_AT_name        : (strp) (offset: 0xcb2): _co_linearray_entry_size
-    <751>   DW_AT_decl_file   : (data1) 19
-    <752>   DW_AT_decl_line   : (data1) 103
-    <753>   DW_AT_decl_column : (data1) 21
-    <754>   DW_AT_type        : (ref4) <0x168>, short int
-    <758>   DW_AT_data_member_location: (data1) 54
- <2><759>: Abbrev Number: 15 (DW_TAG_member)
-    <75a>   DW_AT_name        : (strp) (offset: 0x46d): co_argcount
-    <75e>   DW_AT_decl_file   : (data1) 19
-    <75f>   DW_AT_decl_line   : (data1) 103
-    <760>   DW_AT_decl_column : (data1) 21
-    <761>   DW_AT_type        : (ref4) <0x4f>, int
-    <765>   DW_AT_data_member_location: (data1) 56
- <2><766>: Abbrev Number: 15 (DW_TAG_member)
-    <767>   DW_AT_name        : (strp) (offset: 0xff6): co_posonlyargcount
-    <76b>   DW_AT_decl_file   : (data1) 19
-    <76c>   DW_AT_decl_line   : (data1) 103
-    <76d>   DW_AT_decl_column : (data1) 21
-    <76e>   DW_AT_type        : (ref4) <0x4f>, int
-    <772>   DW_AT_data_member_location: (data1) 60
- <2><773>: Abbrev Number: 15 (DW_TAG_member)
-    <774>   DW_AT_name        : (strp) (offset: 0x11fb): co_kwonlyargcount
-    <778>   DW_AT_decl_file   : (data1) 19
-    <779>   DW_AT_decl_line   : (data1) 103
-    <77a>   DW_AT_decl_column : (data1) 21
-    <77b>   DW_AT_type        : (ref4) <0x4f>, int
-    <77f>   DW_AT_data_member_location: (data1) 64
- <2><780>: Abbrev Number: 15 (DW_TAG_member)
-    <781>   DW_AT_name        : (strp) (offset: 0x548): co_stacksize
-    <785>   DW_AT_decl_file   : (data1) 19
-    <786>   DW_AT_decl_line   : (data1) 103
-    <787>   DW_AT_decl_column : (data1) 21
-    <788>   DW_AT_type        : (ref4) <0x4f>, int
-    <78c>   DW_AT_data_member_location: (data1) 68
- <2><78d>: Abbrev Number: 15 (DW_TAG_member)
-    <78e>   DW_AT_name        : (strp) (offset: 0xbc5): co_firstlineno
-    <792>   DW_AT_decl_file   : (data1) 19
-    <793>   DW_AT_decl_line   : (data1) 103
-    <794>   DW_AT_decl_column : (data1) 21
-    <795>   DW_AT_type        : (ref4) <0x4f>, int
-    <799>   DW_AT_data_member_location: (data1) 72
- <2><79a>: Abbrev Number: 15 (DW_TAG_member)
-    <79b>   DW_AT_name        : (strp) (offset: 0x230d): co_nlocalsplus
-    <79f>   DW_AT_decl_file   : (data1) 19
-    <7a0>   DW_AT_decl_line   : (data1) 103
-    <7a1>   DW_AT_decl_column : (data1) 21
-    <7a2>   DW_AT_type        : (ref4) <0x4f>, int
-    <7a6>   DW_AT_data_member_location: (data1) 76
- <2><7a7>: Abbrev Number: 15 (DW_TAG_member)
-    <7a8>   DW_AT_name        : (strp) (offset: 0x9a7): co_nlocals
-    <7ac>   DW_AT_decl_file   : (data1) 19
-    <7ad>   DW_AT_decl_line   : (data1) 103
-    <7ae>   DW_AT_decl_column : (data1) 21
-    <7af>   DW_AT_type        : (ref4) <0x4f>, int
-    <7b3>   DW_AT_data_member_location: (data1) 80
- <2><7b4>: Abbrev Number: 15 (DW_TAG_member)
-    <7b5>   DW_AT_name        : (strp) (offset: 0x968): co_nplaincellvars
-    <7b9>   DW_AT_decl_file   : (data1) 19
-    <7ba>   DW_AT_decl_line   : (data1) 103
-    <7bb>   DW_AT_decl_column : (data1) 21
-    <7bc>   DW_AT_type        : (ref4) <0x4f>, int
-    <7c0>   DW_AT_data_member_location: (data1) 84
- <2><7c1>: Abbrev Number: 15 (DW_TAG_member)
-    <7c2>   DW_AT_name        : (strp) (offset: 0x1c74): co_ncellvars
-    <7c6>   DW_AT_decl_file   : (data1) 19
-    <7c7>   DW_AT_decl_line   : (data1) 103
-    <7c8>   DW_AT_decl_column : (data1) 21
-    <7c9>   DW_AT_type        : (ref4) <0x4f>, int
-    <7cd>   DW_AT_data_member_location: (data1) 88
- <2><7ce>: Abbrev Number: 15 (DW_TAG_member)
-    <7cf>   DW_AT_name        : (strp) (offset: 0x1ca2): co_nfreevars
-    <7d3>   DW_AT_decl_file   : (data1) 19
-    <7d4>   DW_AT_decl_line   : (data1) 103
-    <7d5>   DW_AT_decl_column : (data1) 21
-    <7d6>   DW_AT_type        : (ref4) <0x4f>, int
-    <7da>   DW_AT_data_member_location: (data1) 92
- <2><7db>: Abbrev Number: 15 (DW_TAG_member)
-    <7dc>   DW_AT_name        : (strp) (offset: 0x1588): co_localsplusnames
-    <7e0>   DW_AT_decl_file   : (data1) 19
-    <7e1>   DW_AT_decl_line   : (data1) 103
-    <7e2>   DW_AT_decl_column : (data1) 21
-    <7e3>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <7e7>   DW_AT_data_member_location: (data1) 96
- <2><7e8>: Abbrev Number: 15 (DW_TAG_member)
-    <7e9>   DW_AT_name        : (strp) (offset: 0x8a5): co_localspluskinds
-    <7ed>   DW_AT_decl_file   : (data1) 19
-    <7ee>   DW_AT_decl_line   : (data1) 103
-    <7ef>   DW_AT_decl_column : (data1) 21
-    <7f0>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <7f4>   DW_AT_data_member_location: (data1) 104
- <2><7f5>: Abbrev Number: 15 (DW_TAG_member)
-    <7f6>   DW_AT_name        : (strp) (offset: 0x15c1): co_filename
-    <7fa>   DW_AT_decl_file   : (data1) 19
-    <7fb>   DW_AT_decl_line   : (data1) 103
-    <7fc>   DW_AT_decl_column : (data1) 21
-    <7fd>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <801>   DW_AT_data_member_location: (data1) 112
- <2><802>: Abbrev Number: 15 (DW_TAG_member)
-    <803>   DW_AT_name        : (strp) (offset: 0xb8d): co_name
-    <807>   DW_AT_decl_file   : (data1) 19
-    <808>   DW_AT_decl_line   : (data1) 103
-    <809>   DW_AT_decl_column : (data1) 21
-    <80a>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <80e>   DW_AT_data_member_location: (data1) 120
- <2><80f>: Abbrev Number: 15 (DW_TAG_member)
-    <810>   DW_AT_name        : (strp) (offset: 0x24c0): co_qualname
-    <814>   DW_AT_decl_file   : (data1) 19
-    <815>   DW_AT_decl_line   : (data1) 103
-    <816>   DW_AT_decl_column : (data1) 21
-    <817>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <81b>   DW_AT_data_member_location: (data1) 128
- <2><81c>: Abbrev Number: 15 (DW_TAG_member)
-    <81d>   DW_AT_name        : (strp) (offset: 0x429): co_linetable
-    <821>   DW_AT_decl_file   : (data1) 19
-    <822>   DW_AT_decl_line   : (data1) 103
-    <823>   DW_AT_decl_column : (data1) 21
-    <824>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <828>   DW_AT_data_member_location: (data1) 136
- <2><829>: Abbrev Number: 15 (DW_TAG_member)
-    <82a>   DW_AT_name        : (strp) (offset: 0x1f90): co_weakreflist
-    <82e>   DW_AT_decl_file   : (data1) 19
-    <82f>   DW_AT_decl_line   : (data1) 103
-    <830>   DW_AT_decl_column : (data1) 21
-    <831>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <835>   DW_AT_data_member_location: (data1) 144
- <2><836>: Abbrev Number: 15 (DW_TAG_member)
-    <837>   DW_AT_name        : (strp) (offset: 0x70b): _co_code
-    <83b>   DW_AT_decl_file   : (data1) 19
-    <83c>   DW_AT_decl_line   : (data1) 103
-    <83d>   DW_AT_decl_column : (data1) 21
-    <83e>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
-    <842>   DW_AT_data_member_location: (data1) 152
- <2><843>: Abbrev Number: 15 (DW_TAG_member)
-    <844>   DW_AT_name        : (strp) (offset: 0x1f7): _co_linearray
-    <848>   DW_AT_decl_file   : (data1) 19
-    <849>   DW_AT_decl_line   : (data1) 103
-    <84a>   DW_AT_decl_column : (data1) 21
-    <84b>   DW_AT_type        : (ref4) <0xea>, char
-    <84f>   DW_AT_data_member_location: (data1) 160
- <2><850>: Abbrev Number: 15 (DW_TAG_member)
-    <851>   DW_AT_name        : (strp) (offset: 0x6ba): _co_firsttraceable
-    <855>   DW_AT_decl_file   : (data1) 19
-    <856>   DW_AT_decl_line   : (data1) 103
-    <857>   DW_AT_decl_column : (data1) 21
-    <858>   DW_AT_type        : (ref4) <0x4f>, int
-    <85c>   DW_AT_data_member_location: (data1) 168
- <2><85d>: Abbrev Number: 15 (DW_TAG_member)
-    <85e>   DW_AT_name        : (strp) (offset: 0xc1d): co_extra
-    <862>   DW_AT_decl_file   : (data1) 19
-    <863>   DW_AT_decl_line   : (data1) 103
-    <864>   DW_AT_decl_column : (data1) 21
-    <865>   DW_AT_type        : (ref4) <0x88>
-    <869>   DW_AT_data_member_location: (data1) 176
- <2><86a>: Abbrev Number: 15 (DW_TAG_member)
-    <86b>   DW_AT_name        : (strp) (offset: 0x22b8): co_code_adaptive
-    <86f>   DW_AT_decl_file   : (data1) 19
-    <870>   DW_AT_decl_line   : (data1) 103
-    <871>   DW_AT_decl_column : (data1) 21
-    <872>   DW_AT_type        : (ref4) <0x1639>, char
-    <876>   DW_AT_data_member_location: (data1) 184
- <2><877>: Abbrev Number: 0
- <1><878>: Abbrev Number: 3 (DW_TAG_typedef)
-    <879>   DW_AT_name        : (strp) (offset: 0x156): PyFrameObject
-    <87d>   DW_AT_decl_file   : (data1) 13
-    <87e>   DW_AT_decl_line   : (data1) 22
-    <87f>   DW_AT_decl_column : (data1) 23
-    <880>   DW_AT_type        : (ref4) <0x884>, _frame
- <1><884>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <885>   DW_AT_name        : (strp) (offset: 0x56d): _frame
-    <889>   DW_AT_declaration : (flag_present) 1
- <1><889>: Abbrev Number: 3 (DW_TAG_typedef)
-    <88a>   DW_AT_name        : (strp) (offset: 0xa80): PyThreadState
-    <88e>   DW_AT_decl_file   : (data1) 13
-    <88f>   DW_AT_decl_line   : (data1) 24
-    <890>   DW_AT_decl_column : (data1) 20
-    <891>   DW_AT_type        : (ref4) <0x895>, _ts
- <1><895>: Abbrev Number: 19 (DW_TAG_structure_type)
-    <896>   DW_AT_name        : (string) _ts
-    <89a>   DW_AT_byte_size   : (data2) 360
-    <89c>   DW_AT_decl_file   : (data1) 20
-    <89d>   DW_AT_decl_line   : (data1) 82
-    <89e>   DW_AT_decl_column : (data1) 8
-    <89f>   DW_AT_sibling     : (ref4) <0xab0>
- <2><8a3>: Abbrev Number: 15 (DW_TAG_member)
-    <8a4>   DW_AT_name        : (strp) (offset: 0x2464): prev
+    <705>   DW_AT_decl_column : (data1) 8
+    <706>   DW_AT_sibling     : (ref4) <0x884>
+ <2><70a>: Abbrev Number: 15 (DW_TAG_member)
+    <70b>   DW_AT_name        : (strp) (offset: 0x397): ob_base
+    <70f>   DW_AT_decl_file   : (data1) 19
+    <710>   DW_AT_decl_line   : (data1) 103
+    <711>   DW_AT_decl_column : (data1) 21
+    <712>   DW_AT_type        : (ref4) <0xbad>, PyVarObject
+    <716>   DW_AT_data_member_location: (data1) 0
+ <2><717>: Abbrev Number: 15 (DW_TAG_member)
+    <718>   DW_AT_name        : (strp) (offset: 0x115e): co_consts
+    <71c>   DW_AT_decl_file   : (data1) 19
+    <71d>   DW_AT_decl_line   : (data1) 103
+    <71e>   DW_AT_decl_column : (data1) 21
+    <71f>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <723>   DW_AT_data_member_location: (data1) 24
+ <2><724>: Abbrev Number: 15 (DW_TAG_member)
+    <725>   DW_AT_name        : (strp) (offset: 0x12e9): co_names
+    <729>   DW_AT_decl_file   : (data1) 19
+    <72a>   DW_AT_decl_line   : (data1) 103
+    <72b>   DW_AT_decl_column : (data1) 21
+    <72c>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <730>   DW_AT_data_member_location: (data1) 32
+ <2><731>: Abbrev Number: 15 (DW_TAG_member)
+    <732>   DW_AT_name        : (strp) (offset: 0xd5a): co_exceptiontable
+    <736>   DW_AT_decl_file   : (data1) 19
+    <737>   DW_AT_decl_line   : (data1) 103
+    <738>   DW_AT_decl_column : (data1) 21
+    <739>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <73d>   DW_AT_data_member_location: (data1) 40
+ <2><73e>: Abbrev Number: 15 (DW_TAG_member)
+    <73f>   DW_AT_name        : (strp) (offset: 0x2331): co_flags
+    <743>   DW_AT_decl_file   : (data1) 19
+    <744>   DW_AT_decl_line   : (data1) 103
+    <745>   DW_AT_decl_column : (data1) 21
+    <746>   DW_AT_type        : (ref4) <0x4f>, int
+    <74a>   DW_AT_data_member_location: (data1) 48
+ <2><74b>: Abbrev Number: 15 (DW_TAG_member)
+    <74c>   DW_AT_name        : (strp) (offset: 0x1b43): co_warmup
+    <750>   DW_AT_decl_file   : (data1) 19
+    <751>   DW_AT_decl_line   : (data1) 103
+    <752>   DW_AT_decl_column : (data1) 21
+    <753>   DW_AT_type        : (ref4) <0x168>, short int
+    <757>   DW_AT_data_member_location: (data1) 52
+ <2><758>: Abbrev Number: 15 (DW_TAG_member)
+    <759>   DW_AT_name        : (strp) (offset: 0xcc2): _co_linearray_entry_size
+    <75d>   DW_AT_decl_file   : (data1) 19
+    <75e>   DW_AT_decl_line   : (data1) 103
+    <75f>   DW_AT_decl_column : (data1) 21
+    <760>   DW_AT_type        : (ref4) <0x168>, short int
+    <764>   DW_AT_data_member_location: (data1) 54
+ <2><765>: Abbrev Number: 15 (DW_TAG_member)
+    <766>   DW_AT_name        : (strp) (offset: 0x47d): co_argcount
+    <76a>   DW_AT_decl_file   : (data1) 19
+    <76b>   DW_AT_decl_line   : (data1) 103
+    <76c>   DW_AT_decl_column : (data1) 21
+    <76d>   DW_AT_type        : (ref4) <0x4f>, int
+    <771>   DW_AT_data_member_location: (data1) 56
+ <2><772>: Abbrev Number: 15 (DW_TAG_member)
+    <773>   DW_AT_name        : (strp) (offset: 0x1006): co_posonlyargcount
+    <777>   DW_AT_decl_file   : (data1) 19
+    <778>   DW_AT_decl_line   : (data1) 103
+    <779>   DW_AT_decl_column : (data1) 21
+    <77a>   DW_AT_type        : (ref4) <0x4f>, int
+    <77e>   DW_AT_data_member_location: (data1) 60
+ <2><77f>: Abbrev Number: 15 (DW_TAG_member)
+    <780>   DW_AT_name        : (strp) (offset: 0x120b): co_kwonlyargcount
+    <784>   DW_AT_decl_file   : (data1) 19
+    <785>   DW_AT_decl_line   : (data1) 103
+    <786>   DW_AT_decl_column : (data1) 21
+    <787>   DW_AT_type        : (ref4) <0x4f>, int
+    <78b>   DW_AT_data_member_location: (data1) 64
+ <2><78c>: Abbrev Number: 15 (DW_TAG_member)
+    <78d>   DW_AT_name        : (strp) (offset: 0x558): co_stacksize
+    <791>   DW_AT_decl_file   : (data1) 19
+    <792>   DW_AT_decl_line   : (data1) 103
+    <793>   DW_AT_decl_column : (data1) 21
+    <794>   DW_AT_type        : (ref4) <0x4f>, int
+    <798>   DW_AT_data_member_location: (data1) 68
+ <2><799>: Abbrev Number: 15 (DW_TAG_member)
+    <79a>   DW_AT_name        : (strp) (offset: 0xbd5): co_firstlineno
+    <79e>   DW_AT_decl_file   : (data1) 19
+    <79f>   DW_AT_decl_line   : (data1) 103
+    <7a0>   DW_AT_decl_column : (data1) 21
+    <7a1>   DW_AT_type        : (ref4) <0x4f>, int
+    <7a5>   DW_AT_data_member_location: (data1) 72
+ <2><7a6>: Abbrev Number: 15 (DW_TAG_member)
+    <7a7>   DW_AT_name        : (strp) (offset: 0x233a): co_nlocalsplus
+    <7ab>   DW_AT_decl_file   : (data1) 19
+    <7ac>   DW_AT_decl_line   : (data1) 103
+    <7ad>   DW_AT_decl_column : (data1) 21
+    <7ae>   DW_AT_type        : (ref4) <0x4f>, int
+    <7b2>   DW_AT_data_member_location: (data1) 76
+ <2><7b3>: Abbrev Number: 15 (DW_TAG_member)
+    <7b4>   DW_AT_name        : (strp) (offset: 0x9b7): co_nlocals
+    <7b8>   DW_AT_decl_file   : (data1) 19
+    <7b9>   DW_AT_decl_line   : (data1) 103
+    <7ba>   DW_AT_decl_column : (data1) 21
+    <7bb>   DW_AT_type        : (ref4) <0x4f>, int
+    <7bf>   DW_AT_data_member_location: (data1) 80
+ <2><7c0>: Abbrev Number: 15 (DW_TAG_member)
+    <7c1>   DW_AT_name        : (strp) (offset: 0x978): co_nplaincellvars
+    <7c5>   DW_AT_decl_file   : (data1) 19
+    <7c6>   DW_AT_decl_line   : (data1) 103
+    <7c7>   DW_AT_decl_column : (data1) 21
+    <7c8>   DW_AT_type        : (ref4) <0x4f>, int
+    <7cc>   DW_AT_data_member_location: (data1) 84
+ <2><7cd>: Abbrev Number: 15 (DW_TAG_member)
+    <7ce>   DW_AT_name        : (strp) (offset: 0x1c8e): co_ncellvars
+    <7d2>   DW_AT_decl_file   : (data1) 19
+    <7d3>   DW_AT_decl_line   : (data1) 103
+    <7d4>   DW_AT_decl_column : (data1) 21
+    <7d5>   DW_AT_type        : (ref4) <0x4f>, int
+    <7d9>   DW_AT_data_member_location: (data1) 88
+ <2><7da>: Abbrev Number: 15 (DW_TAG_member)
+    <7db>   DW_AT_name        : (strp) (offset: 0x1cbc): co_nfreevars
+    <7df>   DW_AT_decl_file   : (data1) 19
+    <7e0>   DW_AT_decl_line   : (data1) 103
+    <7e1>   DW_AT_decl_column : (data1) 21
+    <7e2>   DW_AT_type        : (ref4) <0x4f>, int
+    <7e6>   DW_AT_data_member_location: (data1) 92
+ <2><7e7>: Abbrev Number: 15 (DW_TAG_member)
+    <7e8>   DW_AT_name        : (strp) (offset: 0x1598): co_localsplusnames
+    <7ec>   DW_AT_decl_file   : (data1) 19
+    <7ed>   DW_AT_decl_line   : (data1) 103
+    <7ee>   DW_AT_decl_column : (data1) 21
+    <7ef>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <7f3>   DW_AT_data_member_location: (data1) 96
+ <2><7f4>: Abbrev Number: 15 (DW_TAG_member)
+    <7f5>   DW_AT_name        : (strp) (offset: 0x8b5): co_localspluskinds
+    <7f9>   DW_AT_decl_file   : (data1) 19
+    <7fa>   DW_AT_decl_line   : (data1) 103
+    <7fb>   DW_AT_decl_column : (data1) 21
+    <7fc>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <800>   DW_AT_data_member_location: (data1) 104
+ <2><801>: Abbrev Number: 15 (DW_TAG_member)
+    <802>   DW_AT_name        : (strp) (offset: 0x15d1): co_filename
+    <806>   DW_AT_decl_file   : (data1) 19
+    <807>   DW_AT_decl_line   : (data1) 103
+    <808>   DW_AT_decl_column : (data1) 21
+    <809>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <80d>   DW_AT_data_member_location: (data1) 112
+ <2><80e>: Abbrev Number: 15 (DW_TAG_member)
+    <80f>   DW_AT_name        : (strp) (offset: 0xb9d): co_name
+    <813>   DW_AT_decl_file   : (data1) 19
+    <814>   DW_AT_decl_line   : (data1) 103
+    <815>   DW_AT_decl_column : (data1) 21
+    <816>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <81a>   DW_AT_data_member_location: (data1) 120
+ <2><81b>: Abbrev Number: 15 (DW_TAG_member)
+    <81c>   DW_AT_name        : (strp) (offset: 0x24ed): co_qualname
+    <820>   DW_AT_decl_file   : (data1) 19
+    <821>   DW_AT_decl_line   : (data1) 103
+    <822>   DW_AT_decl_column : (data1) 21
+    <823>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <827>   DW_AT_data_member_location: (data1) 128
+ <2><828>: Abbrev Number: 15 (DW_TAG_member)
+    <829>   DW_AT_name        : (strp) (offset: 0x439): co_linetable
+    <82d>   DW_AT_decl_file   : (data1) 19
+    <82e>   DW_AT_decl_line   : (data1) 103
+    <82f>   DW_AT_decl_column : (data1) 21
+    <830>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <834>   DW_AT_data_member_location: (data1) 136
+ <2><835>: Abbrev Number: 15 (DW_TAG_member)
+    <836>   DW_AT_name        : (strp) (offset: 0x1fb8): co_weakreflist
+    <83a>   DW_AT_decl_file   : (data1) 19
+    <83b>   DW_AT_decl_line   : (data1) 103
+    <83c>   DW_AT_decl_column : (data1) 21
+    <83d>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <841>   DW_AT_data_member_location: (data1) 144
+ <2><842>: Abbrev Number: 15 (DW_TAG_member)
+    <843>   DW_AT_name        : (strp) (offset: 0x71b): _co_code
+    <847>   DW_AT_decl_file   : (data1) 19
+    <848>   DW_AT_decl_line   : (data1) 103
+    <849>   DW_AT_decl_column : (data1) 21
+    <84a>   DW_AT_type        : (ref4) <0xb66>, PyObject, _object
+    <84e>   DW_AT_data_member_location: (data1) 152
+ <2><84f>: Abbrev Number: 15 (DW_TAG_member)
+    <850>   DW_AT_name        : (strp) (offset: 0x207): _co_linearray
+    <854>   DW_AT_decl_file   : (data1) 19
+    <855>   DW_AT_decl_line   : (data1) 103
+    <856>   DW_AT_decl_column : (data1) 21
+    <857>   DW_AT_type        : (ref4) <0xea>, char
+    <85b>   DW_AT_data_member_location: (data1) 160
+ <2><85c>: Abbrev Number: 15 (DW_TAG_member)
+    <85d>   DW_AT_name        : (strp) (offset: 0x6ca): _co_firsttraceable
+    <861>   DW_AT_decl_file   : (data1) 19
+    <862>   DW_AT_decl_line   : (data1) 103
+    <863>   DW_AT_decl_column : (data1) 21
+    <864>   DW_AT_type        : (ref4) <0x4f>, int
+    <868>   DW_AT_data_member_location: (data1) 168
+ <2><869>: Abbrev Number: 15 (DW_TAG_member)
+    <86a>   DW_AT_name        : (strp) (offset: 0xc2d): co_extra
+    <86e>   DW_AT_decl_file   : (data1) 19
+    <86f>   DW_AT_decl_line   : (data1) 103
+    <870>   DW_AT_decl_column : (data1) 21
+    <871>   DW_AT_type        : (ref4) <0x88>
+    <875>   DW_AT_data_member_location: (data1) 176
+ <2><876>: Abbrev Number: 15 (DW_TAG_member)
+    <877>   DW_AT_name        : (strp) (offset: 0x22e5): co_code_adaptive
+    <87b>   DW_AT_decl_file   : (data1) 19
+    <87c>   DW_AT_decl_line   : (data1) 103
+    <87d>   DW_AT_decl_column : (data1) 21
+    <87e>   DW_AT_type        : (ref4) <0x1645>, char
+    <882>   DW_AT_data_member_location: (data1) 184
+ <2><883>: Abbrev Number: 0
+ <1><884>: Abbrev Number: 3 (DW_TAG_typedef)
+    <885>   DW_AT_name        : (strp) (offset: 0x156): PyFrameObject
+    <889>   DW_AT_decl_file   : (data1) 13
+    <88a>   DW_AT_decl_line   : (data1) 22
+    <88b>   DW_AT_decl_column : (data1) 23
+    <88c>   DW_AT_type        : (ref4) <0x890>, _frame
+ <1><890>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <891>   DW_AT_name        : (strp) (offset: 0x57d): _frame
+    <895>   DW_AT_declaration : (flag_present) 1
+ <1><895>: Abbrev Number: 3 (DW_TAG_typedef)
+    <896>   DW_AT_name        : (strp) (offset: 0xa90): PyThreadState
+    <89a>   DW_AT_decl_file   : (data1) 13
+    <89b>   DW_AT_decl_line   : (data1) 24
+    <89c>   DW_AT_decl_column : (data1) 20
+    <89d>   DW_AT_type        : (ref4) <0x8a1>, _ts
+ <1><8a1>: Abbrev Number: 19 (DW_TAG_structure_type)
+    <8a2>   DW_AT_name        : (string) _ts
+    <8a6>   DW_AT_byte_size   : (data2) 360
     <8a8>   DW_AT_decl_file   : (data1) 20
-    <8a9>   DW_AT_decl_line   : (data1) 85
-    <8aa>   DW_AT_decl_column : (data1) 20
-    <8ab>   DW_AT_type        : (ref4) <0x1d29>, PyThreadState, _ts
-    <8af>   DW_AT_data_member_location: (data1) 0
- <2><8b0>: Abbrev Number: 15 (DW_TAG_member)
-    <8b1>   DW_AT_name        : (strp) (offset: 0x23a9): next
-    <8b5>   DW_AT_decl_file   : (data1) 20
-    <8b6>   DW_AT_decl_line   : (data1) 86
-    <8b7>   DW_AT_decl_column : (data1) 20
-    <8b8>   DW_AT_type        : (ref4) <0x1d29>, PyThreadState, _ts
-    <8bc>   DW_AT_data_member_location: (data1) 8
- <2><8bd>: Abbrev Number: 15 (DW_TAG_member)
-    <8be>   DW_AT_name        : (strp) (offset: 0x592): interp
-    <8c2>   DW_AT_decl_file   : (data1) 20
-    <8c3>   DW_AT_decl_line   : (data1) 87
-    <8c4>   DW_AT_decl_column : (data1) 25
-    <8c5>   DW_AT_type        : (ref4) <0x1d2f>, PyInterpreterState, _is
-    <8c9>   DW_AT_data_member_location: (data1) 16
- <2><8ca>: Abbrev Number: 15 (DW_TAG_member)
-    <8cb>   DW_AT_name        : (strp) (offset: 0x18bb): _initialized
-    <8cf>   DW_AT_decl_file   : (data1) 20
-    <8d0>   DW_AT_decl_line   : (data1) 93
-    <8d1>   DW_AT_decl_column : (data1) 9
-    <8d2>   DW_AT_type        : (ref4) <0x4f>, int
-    <8d6>   DW_AT_data_member_location: (data1) 24
- <2><8d7>: Abbrev Number: 15 (DW_TAG_member)
-    <8d8>   DW_AT_name        : (strp) (offset: 0x1d4a): _static
-    <8dc>   DW_AT_decl_file   : (data1) 20
-    <8dd>   DW_AT_decl_line   : (data1) 96
-    <8de>   DW_AT_decl_column : (data1) 9
-    <8df>   DW_AT_type        : (ref4) <0x4f>, int
-    <8e3>   DW_AT_data_member_location: (data1) 28
- <2><8e4>: Abbrev Number: 15 (DW_TAG_member)
-    <8e5>   DW_AT_name        : (strp) (offset: 0x62f): recursion_remaining
-    <8e9>   DW_AT_decl_file   : (data1) 20
-    <8ea>   DW_AT_decl_line   : (data1) 98
-    <8eb>   DW_AT_decl_column : (data1) 9
-    <8ec>   DW_AT_type        : (ref4) <0x4f>, int
-    <8f0>   DW_AT_data_member_location: (data1) 32
